const ce = [
    {group: "sab", name: "สพฺพจิตฺตสาธารณ", cnt: 7, e: ["ผสฺโส", "เวทนา", "สญฺญา", "เจตนา", "เอกคฺคตา", "ชีวิตินฺทฺริยํ", "มนสิกาโร"]}, //สพฺพจิตฺตสาธารณา
    {group: "pa", name: "ปกิณฺณก", cnt: 6, e: ["วิตกฺโก", "วิจาโร", "อธิโมกฺโข", "วีริยํ", "ปีติ", "ฉนฺโท"]}, //ปกิณฺณกา
    {group: "mo", name: "โมหจตุกฺก", cnt: 4, e: ["โมโห", "อหิริกํ", "อโนตฺตปฺปํ", "อุทฺธจฺจํ"]},
    {group: "lo", name: "โลติก", cnt: 3, e: ["โลโภ", "ทิฏฺฐิ", "มาโน"]},
    {group: "do", name: "โทจตุกฺก", cnt: 4, e: ["โทโส", "อิสฺสา", "มจฺฉริยํ", "กุกฺกุจฺจํ"]},
    {group: "di", name: "ถีทุก", cnt: 2, e: ["ถินํ", "มิทฺธํ"]},
    {group: "vi", name: "วิจิกิจฺฉา", cnt: 1, e: ["วิจิกิจฺฉา"]},
    {group: "so", name: "โสภณสาธารณ", cnt: 19, e: ["สทฺธา", "สติ", "หิริ", "โอตฺตปฺปํ", "อโลโภ", "อโทโส", "ตตฺรมชฺฌตฺตตา", "กายปสฺสทฺธิ", "จิตฺตปสฺสทฺธิ", "กายลหุตา", "จิตฺตลหุตา", "กายมุทุตา", "จิตฺตมุทุตา", "กายกมฺมญฺญตา", "จิตฺตกมฺมญฺญตา", "กายปาคุญฺญตา", "จิตฺตปาคุญฺญตา", "กายุชุกตา", "จิตฺตุชุกตา"]},
    {group: "ti", name: "วิรตี", cnt: 3, e: ["สมฺมาวาจา", "สมฺมากมฺมนฺโต", "สมฺมาอาชีโว"]},
    {group: "ap", name: "อปฺปมญฺญา", cnt: 2, e: ["กรุณา", "มุทิตา"]},
    {group: "pan", name: "ปญฺญินฺทฺริย", cnt: 1, e: ["ปญฺญินฺทฺริยํ"]}
];



const ci = [
    {nick: "lo1", name:"โลภสหคตจิตฺตํ #1", nn:"โลโส.สํ.อสํ", cer: [["pa"], ["mo"], ["lo", [0,1]]]},
    {nick: "lo2", name:"โลภสหคตจิตฺตํ #2", nn:"โลโส.สํ.สสํ", cer: [["pa"], ["mo"], ["lo", [0,1]]], unc_saha: [["di"]]},
    {nick: "lo3", name:"โลภสหคตจิตฺตํ #3", nn:"โลโส.วิปฺ.อสํ", cer: [["pa"], ["mo"], ["lo", [0]]],  unc_nana: [["lo", [2]]]},
    {nick: "lo4", name:"โลภสหคตจิตฺตํ #4", nn:"โลโส.วิป.สสํ", cer: [["pa"], ["mo"], ["lo", [0]]],  unc_nana: [["lo", [2]]], unc_saha: [["di"]]},
    {nick: "lo5", name:"โลภสหคตจิตฺตํ #5", nn:"โลอุ.สํ.อสํ", cer: [["pa", [0,1,2,3,5]], ["mo"], ["lo", [0,1]]] },
    {nick: "lo6", name:"โลภสหคตจิตฺตํ #6", nn:"โลอุ.สํ.สสํ", cer: [["pa", [0,1,2,3,5]], ["mo"], ["lo", [0,1]]],  unc_saha: [["di"]]},
    {nick: "lo7", name:"โลภสหคตจิตฺตํ #7", nn:"โลอุ.วิปฺ.อสํ", cer: [["pa", [0,1,2,3,5]], ["mo"], ["lo", [0]]],  unc_nana: [["lo", [2]]]},
    {nick: "lo8", name:"โลภสหคตจิตฺตํ #8", nn:"โลอุ.วิปฺ.สสํ", cer: [["pa", [0,1,2,3,5]], ["mo"], ["lo", [0]]], unc_nana: [["lo", [2]]], unc_saha: [["di"]]},

    {nick: "do1", name:"ปฏิฆสมฺปยุตฺตจิตฺตํ #1", nn:"โท.อสํ", cer: [["pa", [0,1,2,3,5]], ["mo"], ["do", [0]]], unc_nana: [["do", [1,2,3]]]},
    {nick: "do2", name:"ปฏิฆสมฺปยุตฺตจิตฺตํ #2", nn:"โท.สสํ", cer: [["pa", [0,1,2,3,5]], ["mo"], ["do", [0]]], unc_nana: [["do", [1,2,3]]], unc_saha: [["di"]]},

    {nick: "vici", name:"วิจิกิจฺฉาสมฺปยุตฺตจิตฺตํ", nn:"วิจิ", cer: [["pa", [0,1,3]], ["mo"], ["vi"]]},
    {nick: "ud", name:"อุทฺธจฺจสมฺปยุตฺตจิตฺตํ", nn:"อุทฺ", cer: [["pa", [0,1,2,3]], ["mo"]]},

    {nick: "aku_cak", name:"จกฺขุวิญฺญาณํ (อกุสลวิปากจิตฺตํ)", nn:"อกุวิ.จกฺขุ"},
    {nick: "ku_cak", name:"จกฺขุวิญฺญาณํ (กุสลวิปากจิตฺตํ)", nn:"กุวิ.จกฺขุ"},
    {nick: "aku_sot", name:"โสตวิญฺญาณํ (อกุสลวิปากจิตฺตํ)", nn:"อกุวิ.โสต"},
    {nick: "ku_sot", name:"โสตวิญฺญาณํ (กุสลวิปากจิตฺตํ)", nn:"กุวิ.โสต"},
    {nick: "aku_gha", name:"ฆานวิญฺญาณํ (อกุสลวิปากจิตฺตํ)", nn:"อกุวิ.ฆาน"},
    {nick: "ku_gha", name:"ฆานวิญฺญาณํ (กุสลวิปากจิตฺตํ)", nn:"กุวิ.ฆาน"},
    {nick: "aku_jiv", name:"ชิวฺหาวิญฺญาณํ (อกุสลวิปากจิตฺตํ)", nn:"อกุวิ.ชิวฺหา"},
    {nick: "ku_jiv", name:"ชิวฺหาวิญฺญาณํ (กุสลวิปากจิตฺตํ)", nn:"กุวิ.ชิวฺหา"},
    {nick: "aku_kay", name:"กายวิญฺญาณํ (อกุสลวิปากจิตฺตํ)", nn:"อกุวิ.กาย"},
    {nick: "ku_kay", name:"กายวิญฺญาณํ (กุสลวิปากจิตฺตํ)", nn:"กุวิ.กาย"},

    {nick: "aku_sam", name:"สมฺปฏิจฺฉนจิตฺตํ (อกุสลวิปากจิตฺตํ)", nn:"อกุ.สมฺ", cer: [["pa", [0,1,2]]]},
    {nick: "ku_sam", name:"สมฺปฏิจฺฉนจิตฺตํ (กุสลวิปากจิตฺตํ)", nn:"กุ.สมฺ", cer: [["pa", [0,1,2]]]},
    {nick: "panca", name:"ปญฺจทฺวาราวชฺชนจิตฺตํ", nn:"ปญฺจ", cer: [["pa", [0,1,2]]]},

    {nick: "aku_san", name:"สนฺตีรณจิตฺตํ (อกุสลวิปากจิตฺตํ)", nn:"อกุ.สนฺตี", cer: [["pa", [0,1,2]]]},
    {nick: "ku_san", name:"อุเปกฺขาสหคตํ สนฺตีรณจิตฺตํ (กุสลวิปากจิตฺตํ)", nn:"อุ.กุ.สนฺตี", cer: [["pa", [0,1,2]]]},
    {nick: "ku_san", name:"โสมนสฺสสหคตํ สนฺตีรณจิตฺตํ", nn:"โส.สนฺตี", cer: [["pa", [0,1,2,4]]]},

    {nick: "mano", name:"มโนทฺวาราวชฺชนจิตฺตํ", nn:"มโน", cer: [["pa", [0,1,2,3]]]},
    {nick: "hasi", name:"หสิตุปฺปาทจิตฺตํ", nn:"หสิ", cer: [["pa", [0,1,2,3,4]]]},

    {nick: "mku1", name:"กามาวจรกุสลจิตฺตํ #1", nn:"มกุ.โส.สํ.อสํ", cer: [["pa"], ["so"], ["pan"]], unc_nana: [["ti"], ["ap"]]},
    {nick: "mku2", name:"กามาวจรกุสลจิตฺตํ #2", nn:"มกุ.โส.สํ.สสํ", cer: [["pa"], ["so"], ["pan"]], unc_nana: [["ti"], ["ap"]]},
    {nick: "mku3", name:"กามาวจรกุสลจิตฺตํ #3", nn:"มกุ.โส.วิปฺ.อสํ", cer: [["pa"], ["so"]], unc_nana: [["ti"], ["ap"]]},
    {nick: "mku4", name:"กามาวจรกุสลจิตฺตํ #4", nn:"มกุ.โส.วิปฺ.สสํ", cer: [["pa"], ["so"]], unc_nana: [["ti"], ["ap"]]},
    {nick: "mku5", name:"กามาวจรกุสลจิตฺตํ #5", nn:"มกุ.อุ.สํ.อสํ", cer: [["pa", [0,1,2,3,5]], ["so"], ["pan"]], unc_nana: [["ti"], ["ap"]]},
    {nick: "mku6", name:"กามาวจรกุสลจิตฺตํ #6", nn:"มกุ.อุ.สํ.สสํ", cer: [["pa", [0,1,2,3,5]], ["so"], ["pan"]], unc_nana: [["ti"], ["ap"]]},
    {nick: "mku7", name:"กามาวจรกุสลจิตฺตํ #7", nn:"มกุ.อุ.วิปฺ.อสํ", cer: [["pa", [0,1,2,3,5]], ["so"]], unc_nana: [["ti"], ["ap"]]},
    {nick: "mku8", name:"กามาวจรกุสลจิตฺตํ #8", nn:"มกุ.อุ.วิปฺ.สสํ", cer: [["pa", [0,1,2,3,5]], ["so"]], unc_nana: [["ti"], ["ap"]]},

    {nick: "mvi1", name:"สเหตุกกามาวจรวิปากจิตฺตํ #1", nn:"มวิ.โส.สํ.อสํ", cer: [["pa"], ["so"], ["pan"]]},
    {nick: "mvi2", name:"สเหตุกกามาวจรวิปากจิตฺตํ #2", nn:"มวิ.โส.สํ.สสํ", cer: [["pa"], ["so"], ["pan"]]},
    {nick: "mvi3", name:"สเหตุกกามาวจรวิปากจิตฺตํ #3", nn:"มวิ.โส.วิปฺ.อสํ", cer: [["pa"], ["so"]]},
    {nick: "mvi4", name:"สเหตุกกามาวจรวิปากจิตฺตํ #4", nn:"มวิ.โส.วิปฺ.สสํ", cer: [["pa"], ["so"]]},
    {nick: "mvi5", name:"สเหตุกกามาวจรวิปากจิตฺตํ #5", nn:"มวิ.อุ.สํ.อสํ", cer: [["pa", [0,1,2,3,5]], ["so"], ["pan"]]},
    {nick: "mvi6", name:"สเหตุกกามาวจรวิปากจิตฺตํ #6", nn:"มวิ.อุ.สํ.สสํ", cer: [["pa", [0,1,2,3,5]], ["so"], ["pan"]]},
    {nick: "mvi7", name:"สเหตุกกามาวจรวิปากจิตฺตํ #7", nn:"มวิ.อุ.วิปฺ.อสํ", cer: [["pa", [0,1,2,3,5]], ["so"]]},
    {nick: "mvi8", name:"สเหตุกกามาวจรวิปากจิตฺตํ #8", nn:"มวิ.อุ.วิปฺ.สสํ", cer: [["pa", [0,1,2,3,5]], ["so"]]},

    {nick: "mki1", name:"สเหตุกกามาวจรกิริยจิตฺตํ #1", nn:"มกิ.โส.สํ.อสํ", cer: [["pa"], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "mki2", name:"สเหตุกกามาวจรกิริยจิตฺตํ #2", nn:"มกิ.โส.สํ.สสํ", cer: [["pa"], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "mki3", name:"สเหตุกกามาวจรกิริยจิตฺตํ #3", nn:"มกิ.โส.วิปฺ.อสํ", cer: [["pa"], ["so"]], unc_nana: [["ap"]]},
    {nick: "mki4", name:"สเหตุกกามาวจรกิริยจิตฺตํ #4", nn:"มกิ.โส.วิปฺ.สสํ", cer: [["pa"], ["so"]], unc_nana: [["ap"]]},
    {nick: "mki5", name:"สเหตุกกามาวจรกิริยจิตฺตํ #5", nn:"มกิ.อุ.สํ.อสํ", cer: [["pa", [0,1,2,3,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "mki6", name:"สเหตุกกามาวจรกิริยจิตฺตํ #6", nn:"มกิ.อุ.สํ.สสํ", cer: [["pa", [0,1,2,3,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "mki7", name:"สเหตุกกามาวจรกิริยจิตฺตํ #7", nn:"มกิ.อุ.วิปฺ.อสํ", cer: [["pa", [0,1,2,3,5]], ["so"]], unc_nana: [["ap"]]},
    {nick: "mki8", name:"สเหตุกกามาวจรกิริยจิตฺตํ #8", nn:"มกิ.อุ.วิปฺ.สสํ", cer: [["pa", [0,1,2,3,5]], ["so"]], unc_nana: [["ap"]]},

    {nick: "ruku1", name:"รูปาวจรกุสลจิตฺตํ #1", nn:"รูป.ปฐมฌาน.กุ", cer: [["pa"], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "ruvi1", name:"รูปาวจรวิปากจิตฺตํ #1", nn:"รูป.ปฐมฌาน.วิ", cer: [["pa"], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "ruki1", name:"รูปาวจรกิริยจิตฺตํ #1", nn:"รูป.ปฐมฌาน.กิ", cer: [["pa"], ["so"], ["pan"]], unc_nana: [["ap"]]},

    {nick: "ruku2", name:"รูปาวจรกุสลจิตฺตํ #2", nn:"รูป.ทุติยฌาน.กุ", cer: [["pa", [1,2,3,4,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "ruvi2", name:"รูปาวจรวิปากจิตฺตํ #2", nn:"รูป.ทุติยฌาน.วิ", cer: [["pa", [1,2,3,4,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "ruki2", name:"รูปาวจรกิริยจิตฺตํ #2", nn:"รูป.ทุติยฌาน.กิ", cer: [["pa", [1,2,3,4,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},

    {nick: "ruku3", name:"รูปาวจรกุสลจิตฺตํ #3", nn:"รูป.ตติยฌาน.กุ", cer: [["pa", [2,3,4,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "ruvi3", name:"รูปาวจรวิปากจิตฺตํ #3", nn:"รูป.ตติยฌาน.วิ", cer: [["pa", [2,3,4,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "ruki3", name:"รูปาวจรกิริยจิตฺตํ #3", nn:"รูป.ตติยฌาน.กิ", cer: [["pa", [2,3,4,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},

    {nick: "ruku4", name:"รูปาวจรกุสลจิตฺตํ #4", nn:"รูป.จตุตฺถฌาน.กุ", cer: [["pa", [2,3,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "ruvi4", name:"รูปาวจรวิปากจิตฺตํ #4", nn:"รูป.จตุตฺถฌาน.วิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},
    {nick: "ruki4", name:"รูปาวจรกิริยจิตฺตํ #4", nn:"รูป.จตุตฺถฌาน.กิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]], unc_nana: [["ap"]]},

    {nick: "ruku5", name:"รูปาวจรกุสลจิตฺตํ #5", nn:"รูป.ปญฺจมฌาน.กุ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "ruvi5", name:"รูปาวจรวิปากจิตฺตํ #5", nn:"รูป.ปญฺจมฌาน.วิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "ruki5", name:"รูปาวจรกิริยจิตฺตํ #5", nn:"รูป.ปญฺจมฌาน.กิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},

    {nick: "aruku1", name:"อรูปาวจรกุสลจิตฺตํ #1", nn:"อากา.กุ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "aruvi1", name:"อรูปาวจรวิปากจิตฺตํ #1", nn:"อากา.วิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "aruki1", name:"อรูปาวจรกิริยจิตฺตํ #1", nn:"อากา.กิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},

    {nick: "aruku2", name:"อรูปาวจรกุสลจิตฺตํ #2", nn:"วิญฺญา.กุ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "aruvi2", name:"อรูปาวจรวิปากจิตฺตํ #2", nn:"วิญฺญา.วิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "aruki2", name:"อรูปาวจรกิริยจิตฺตํ #2", nn:"วิญฺญา.กิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},

    {nick: "aruku3", name:"อรูปาวจรกุสลจิตฺตํ #3", nn:"อากิญ.กุ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "aruvi3", name:"อรูปาวจรวิปากจิตฺตํ #3", nn:"อากิญฺ.วิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "aruki3", name:"อรูปาวจรกิริยจิตฺตํ #3", nn:"อากิญฺ.กิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},

    {nick: "aruku4", name:"อรูปาวจรกุสลจิตฺตํ #4", nn:"เนว.กุ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "aruvi4", name:"อรูปาวจรวิปากจิตฺตํ #4", nn:"เนว.วิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},
    {nick: "aruki4", name:"อรูปาวจรกิริยจิตฺตํ #4", nn:"เนว.กิ", cer: [["pa", [2,3,5]], ["so"], ["pan"]]},

    {nick: "somag1", name89:"โสตาปตฺติมคฺคจิตฺตํ", name:"โสตาปตฺติมคฺคจิตฺตํ #1", nn89:"โส.มคฺ", nn:"ปฐมฌาน.โส.มคฺ", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "samag1", name89:"สกทาคามิมคฺคจิตฺตํ", name:"สกทาคามิมคฺคจิตฺตํ #1", nn89:"สกม", nn:"ปฐมฌาน.สกม", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag1", name89:"อนาคามิมคฺคจิตฺตํ", name:"อนาคามิมคฺคจิตฺตํ #1", nn89:"อนม", nn:"ปฐมฌาน.อนม", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "armag1", name89:"อรหตฺตมคฺคจิตฺตํ", name:"อรหตฺตมคฺคจิตฺตํ #1", nn89:"อรม", nn:"ปฐมฌาน.อรม", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "somag1", name89:"โสตาปตฺติผลจิตฺตํ", name:"โสตาปตฺติผลจิตฺตํ #1", nn89:"โส.ผล", nn:"ปฐมฌาน.โส.ผล", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "samag1", name89:"สกทาคามิผลจิตฺตํ", name:"สกทาคามิผลจิตฺตํ #1", nn89:"สกผ", nn:"ปฐมฌาน.สกผ", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag1", name89:"อนาคามิผลจิตฺตํ", name:"อนาคามิผลจิตฺตํ #1", nn89:"อนผ", nn:"ปฐมฌาน.อนผ", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "armag1", name89:"อรหตฺตผลจิตฺตํ", name:"อรหตฺตผลจิตฺตํ #1", nn89:"อรผ", nn:"ปฐมฌาน.อรผ", cer: [["pa"], ["so"], ["ti"], ["pan"]]},

    {nick: "somag2", name:"โสตาปตฺติมคฺคจิตฺตํ #2", nn:"ทุติยฌาน.โส.มคฺ", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "samag2", name:"สกทาคามิมคฺคจิตฺตํ #2", nn:"ทุติยฌาน.สกม", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag2", name:"อนาคามิมคฺคจิตฺตํ #2", nn:"ทุติยฌาน.อนม", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "armag2", name:"อรหตฺตมคฺคจิตฺตํ #2", nn:"ทุติยฌาน.อรม", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "somag2", name:"โสตาปตฺติผลจิตฺตํ #2", nn:"ทุติยฌาน.โส.ผล", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "samag2", name:"สกทาคามิผลจิตฺตํ #2", nn:"ทุติยฌาน.สกผ", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag2", name:"อนาคามิผลจิตฺตํ #2", nn:"ทุติยฌาน.อนผ", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "armag2", name:"อรหตฺตผลจิตฺตํ #2", nn:"ทุติยฌาน.อรผ", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},

    {nick: "somag3", name:"โสตาปตฺติมคฺคจิตฺตํ #3", nn:"ตติยฌาน.โส.มคฺ", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "samag3", name:"สกทาคามิมคฺคจิตฺตํ #3", nn:"ตติยฌาน.สกม", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag3", name:"อนาคามิมคฺคจิตฺตํ #3", nn:"ตติยฌาน.อนม", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "armag3", name:"อรหตฺตมคฺคจิตฺตํ #3", nn:"ตติยฌาน.อรม", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "somag3", name:"โสตาปตฺติผลจิตฺตํ #3", nn:"ตติยฌาน.โส.ผล", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "samag3", name:"สกทาคามิผลจิตฺตํ #3", nn:"ตติยฌาน.สกผ", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag3", name:"อนาคามิผลจิตฺตํ #3", nn:"ตติยฌาน.อนผ", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "armag3", name:"อรหตฺตผลจิตฺตํ #3", nn:"ตติยฌาน.อรผ", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},

    {nick: "somag4", name:"โสตาปตฺติมคฺคจิตฺตํ #4", nn:"จตุตฺถฌาน.โส.มคฺ", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "samag4", name:"สกทาคามิมคฺคจิตฺตํ #4", nn:"จตุตฺถฌาน.สกม", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag4", name:"อนาคามิมคฺคจิตฺตํ #4", nn:"จตุตฺถฌาน.อนม", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "armag4", name:"อรหตฺตมคฺคจิตฺตํ #4", nn:"จตุตฺถฌาน.อรม", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "somag4", name:"โสตาปตฺติผลจิตฺตํ #4", nn:"จตุตฺถฌาน.โส.ผล", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "samag4", name:"สกทาคามิผลจิตฺตํ #4", nn:"จตุตฺถฌาน.สกผ", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag4", name:"อนาคามิผลจิตฺตํ #4", nn:"จตุตฺถฌาน.อนผ", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "armag4", name:"อรหตฺตผลจิตฺตํ #4", nn:"จตุตฺถฌาน.อรผ", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},

    {nick: "somag5", name:"โสตาปตฺติมคฺคจิตฺตํ #5", nn:"ปญฺจมฌาน.โส.มคฺ", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "samag5", name:"สกทาคามิมคฺคจิตฺตํ #5", nn:"ปญฺจมฌาน.สกม", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag5", name:"อนาคามิมคฺคจิตฺตํ #5", nn:"ปญฺจมฌาน.อนม", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "armag5", name:"อรหตฺตมคฺคจิตฺตํ #5", nn:"ปญฺจมฌาน.อรม", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "somag5", name:"โสตาปตฺติผลจิตฺตํ #5", nn:"ปญฺจมฌาน.โส.ผล", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "samag5", name:"สกทาคามิผลจิตฺตํ #5", nn:"ปญฺจมฌาน.สกผ", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anmag5", name:"อนาคามิผลจิตฺตํ #5", nn:"ปญฺจมฌาน.อนผ", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "armag5", name:"อรหตฺตผลจิตฺตํ #5", nn:"ปญฺจมฌาน.อรผ", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]}

    /*
    {nick: "sopho1", name:"โสตาปตฺติผลจิตฺตํ #1", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "sopho2", name:"โสตาปตฺติผลจิตฺตํ #2", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "sopho3", name:"โสตาปตฺติผลจิตฺตํ #3", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "sopho4", name:"โสตาปตฺติผลจิตฺตํ #4", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "sopho5", name:"โสตาปตฺติผลจิตฺตํ #5", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},

    {nick: "sapho1", name:"สกทาคามิผลจิตฺตํ #1", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "sapho2", name:"สกทาคามิผลจิตฺตํ #2", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "sapho3", name:"สกทาคามิผลจิตฺตํ #3", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "sapho4", name:"สกทาคามิผลจิตฺตํ #4", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "sapho5", name:"สกทาคามิผลจิตฺตํ #5", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},

    {nick: "anpho1", name:"อนาคามิผลจิตฺตํ #1", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "anpho2", name:"อนาคามิผลจิตฺตํ #2", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anpho3", name:"อนาคามิผลจิตฺตํ #3", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anpho4", name:"อนาคามิผลจิตฺตํ #4", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "anpho5", name:"อนาคามิผลจิตฺตํ #5", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},

    {nick: "arpho1", name:"อรหตฺตผลจิตฺตํ #1", cer: [["pa"], ["so"], ["ti"], ["pan"]]},
    {nick: "arpho2", name:"อรหตฺตผลจิตฺตํ #2", cer: [["pa", [1,2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "arpho3", name:"อรหตฺตผลจิตฺตํ #3", cer: [["pa", [2,3,4,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "arpho4", name:"อรหตฺตผลจิตฺตํ #4", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]},
    {nick: "arpho5", name:"อรหตฺตผลจิตฺตํ #5", cer: [["pa", [2,3,5]], ["so"], ["ti"], ["pan"]]} */
];

const ru = [
    {group: "มหาภูตรูป", name: "ปฐวีธาตุ", base: [1,1,1,1], sumbase: 4},
    {group: "มหาภูตรูป", name: "อาโปธาตุ", base: [1,1,1,1], sumbase: 4},
    {group: "มหาภูตรูป", name: "เตโชธาตุ", base: [1,1,1,1], sumbase: 4},
    {group: "มหาภูตรูป", name: "วาโยธาตุ", base: [1,1,1,1], sumbase: 4},

    {group: "ปสาทรูป", name: "จกฺขุ", base: [1,0,0,0], sumbase: 1}, //4
    {group: "ปสาทรูป", name: "โสตํ", base: [1,0,0,0], sumbase: 1},
    {group: "ปสาทรูป", name: "ฆานํ", base: [1,0,0,0], sumbase: 1},
    {group: "ปสาทรูป", name: "ชิวฺหา", base: [1,0,0,0], sumbase: 1},
    {group: "ปสาทรูป", name: "กาโย", base: [1,0,0,0], sumbase: 1},

    {group: "โคจรรูป", name: "รูปํ", base: [1,1,1,1], sumbase: 4}, //9
    {group: "โคจรรูป", name: "สทฺโท", base: [0,1,1,0], sumbase: 2},
    {group: "โคจรรูป", name: "คนฺโธ", base: [1,1,1,1], sumbase: 4},
    {group: "โคจรรูป", name: "รโส", base: [1,1,1,1], sumbase: 4},

    {group: "ภาวรูป", name: "อิตฺถตฺตํ", base: [1,0,0,0], sumbase: 1}, //13
    {group: "ภาวรูป", name: "ปุริสตฺตํ", base: [1,0,0,0], sumbase: 1},

    {group: "หทยรูป", name: "หทยวตฺถุ", base: [1,0,0,0], sumbase: 1}, //15
    {group: "ชีวิตรูป", name: "ชีวิตินฺทฺริยํ", base: [1,0,0,0], sumbase: 1},
    {group: "อาหารรูป", name: "กพฬีกาโร อาหาโร", base: [1,1,1,1], sumbase: 4},

    {group: "ปริจฺเฉทรูป", name: "อากาสธาตุ", base: [1,1,1,1], sumbase: 4}, //18

    {group: "วิญฺญตฺติรูป", name: "กายวิญฺญตฺติ", base: [0,1,0,0], sumbase: 1}, //19 วิญญัตติรูปเป็นวิการรูปด้วย
    {group: "วิญฺญตฺติรูป", name: "วจีวิญฺญตฺติ", base: [0,1,0,0], sumbase: 1},

    {group: "วิการรูป", name: "รูปสฺส ลหุตา", base: [0,1,1,1], sumbase: 3}, //21
    {group: "วิการรูป", name: "รูปสฺส มุทุตา", base: [0,1,1,1], sumbase: 3},
    {group: "วิการรูป", name: "รูปสฺส กมฺมญฺญตา", base: [0,1,1,1], sumbase: 3},

    {group: "ลกฺขณรูป", name: "รูปสฺส อุปจโย", base: [0,0,0,0], sumbase: 0}, //24
    {group: "ลกฺขณรูป", name: "รูปสฺส สนฺตติ", base: [0,0,0,0], sumbase: 0},
    {group: "ลกฺขณรูป", name: "รูปสฺส ชรตา", base: [0,0,0,0], sumbase: 0},
    {group: "ลกฺขณรูป", name: "รูปสฺส อนิจฺจตา", base: [0,0,0,0], sumbase: 0},

];

const ru_set = [

    {name: "อชฺฌตฺติกรูป", pre: "เป็น", mem:[[4,8]]},
    {name: "พาหิรรูป", pre: "เป็น", mem:[[0,3],[9,27]]},
    {name: "วตฺถุรูป", pre: "เป็น", mem:[[4,8],15]},
    {name: "อวตฺถุรูป", pre: "เป็น", mem:[[0,3],[9,14],[16,27]]},
    {name: "ทฺวารรูป", pre: "เป็น", mem:[[4,8],19,20]},
    {name: "อทฺวารรูป", pre: "เป็น", mem:[[0,3],[9,18],[21,27]]},
    {name: "อินฺทฺริยรูป", pre: "เป็น", mem:[[4,8],13,14,16]},
    {name: "อนินฺทฺริยรูป", pre: "เป็น", mem:[[0,3],[9,12],15,[17,27]]},
    {name: "โอฬาริกรูป", pre: "เป็น", mem:[0,[2,12]]},
    {name: "สุขุมรูป", pre: "เป็น", mem:[1,[13,27]]},
    {name: "สนฺติเกรูป", pre: "เป็น", mem:[0,[2,12]]},
    {name: "ทูเรรูป", pre: "เป็น", mem:[1,[13,27]]},
    {name: "สปฺปฏิฆรูป", pre: "เป็น", mem:[0,[2,12]]},
    {name: "อปฺปฏิฆรูป", pre: "เป็น", mem:[1,[13,27]]},
    {name: "อุปาทินฺนรูป", pre: "เป็น", post: "ได้", mem:[[0,9],[11,18]]},
    {name: "อนุปาทินฺนรูป", pre: "เป็น", post: "ได้", mem:[10,[19,27]]},
    {name: "สนิทสฺสนรูป", pre: "เป็น", mem:[9]},
    {name: "อนิทสฺสนรูป", pre: "เป็น", mem:[[0,8],[10,27]]},
    {name: "โคจรคฺคาหิกรูป", pre: "เป็น", mem:[[4,8]]},
    {name: "อโคจรคาหิกรูป", pre: "เป็น", mem:[[0,3],[9,27]]},
    {name: "อวินิพฺโภครูป", pre: "เป็น", mem:[[0,3],9,11,12,17]},
    {name: "วินิพฺโภครูป", pre: "เป็น", mem:[[4,8],10,[13,16],[18,27]]}, //21

    {name: "กมฺมสมุฏฺฐานรูป", pre: "เป็น", post: "ได้", mem:[[0,9],[11,18]]},
    {name: "จิตฺตสมุฏฺฐานรูป", pre: "เป็น", post: "ได้", mem:[[0,3],[9,12],[17,23]]},
    {name: "อุตุสมุฏฺฐานรูป", pre: "เป็น", post: "ได้", mem:[[0,3],[9,12],17,18,[21,23]]},
    {name: "อาหารสมุฏฺฐานรูป", pre: "เป็น", post: "ได้", mem:[[0,3],9,11,12,17,18,[21,23]]}, //25

    {name: "เอกนฺตกมฺมชรูป", pre: "เป็น", mem:[[4,8],[13,16]]},
    {name: "เอกนฺตจิตฺตชรูป", pre: "เป็น", mem:[19,20]},
    {name: "เอกนฺตอุตุชรูป", pre: "เป็น", mem:[]},
    {name: "เอกนฺตอาหารชรูป", pre: "เป็น", mem:[]}, //29

    {name: "อเนกนฺตกมฺมชรูป", pre: "เป็น", mem:[[0,3],9,11,12,17,18]},
    {name: "อเนกนฺตจิตฺตชรูป", pre: "เป็น", mem:[[0,3],[9,12],17,18,[21,23]]},
    {name: "อเนกนฺตอุตุชรูป", pre: "เป็น", mem:[[0,3],9,11,12,17,18,[21,23]]},
    {name: "อเนกนฺตอาหารชรูป", pre: "เป็น", mem:[[0,3],[9,12],17,18,[21,23]]}, //33

    {name: "เอกสมุฏฺฐานิกรูป", pre: "เป็น", mem:[[4,8],[13,16],19,20]},
    {name: "ทฺวิสมุฏฺฐานิกรูป", pre: "เป็น", mem:[10]},
    {name: "ติสมุฏฺฐานิกรูป", pre: "เป็น", mem:[[21,23]]},
    {name: "จตุสมุฏฺฐานิกรูป", pre: "เป็น", mem:[[0,3],9,11,12,17,18]},
    {name: "นกุโตจิสมุฏฺฐานิกรูป", pre: "เป็น", mem:[[24,27]]}, //38

    {name: "จกฺขุทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,4],9,11,12,16,17]},
    {name: "โสกทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],5,9,11,12,16,17]},
    {name: "ฆานทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],6,9,11,12,16,17]},
    {name: "ชิวฺหาทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],7,9,11,12,16,17]},
    {name: "กายทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],8,9,11,12,16,17]},
    {name: "อิตฺถิภาวทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],9,11,12,13,16,17]},
    {name: "ปุมฺภาวทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],9,11,12,14,16,17]},
    {name: "วตฺถุทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],9,11,12,15,16,17]},
    {name: "ชีวิตนวกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],9,11,12,16,17]},

    {name: "สุทฺธฏฺฐกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],9,11,12,17]},
    {name: "สทฺทนวกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],[9,12],17]},
    {name: "กายวิญฺญตฺตินวกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],9,11,12,17,19]},
    {name: "วจีวิญฺญตฺติสทฺททสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],[9,12],17,20]},
    {name: "ลหุตาทิเอกาทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],9,11,12,17,[21,23]]},
    {name: "สทฺทลหุตาทิเอกาทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],[9,12],17,[21,23]]},
    {name: "กายวิญฺญตฺติลหุตาทิทฺวาทสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],9,11,12,17,19,[21,23]]},
    {name: "วจีวิญฺญตฺติสทฺทลหุตาทิเตรสกกลาป", pre: "อยู่ใน", post: "ได้", mem:[[0,3],[9,12],17,[20,23]]},

    {name: "กามภูมิ 11", pre: "เกิดใน", post: "ได้", mem:[[0,27]]},
    {name: "รูปภูมิ 15 (เว้นอสัญญสัตตภูมิ)", pre: "เกิดใน", post: "ได้", mem:[[0,5],[9,12],[15,27]]},
    {name: "อสัญญสัตตภูมิ", pre: "เกิดใน", post: "ได้", mem:[[0,3],9,11,12,[16,18],[21,27]]},
    {name: "อรูปภูมิ 4", pre: "เกิดใน", post: "ได้", mem:[]},

    {name: "แก่สังเสทชะบุคคลและโอปปติกะกามบุคคล ในปฏิสนธิกาล", pre: "เกิดครั้งแรก", post: "ได้", mem:[[0,9],[11,18],24,25]},
    {name: "แก่สังเสทชะบุคคลและโอปปติกะกามบุคคล ในปวัตติกาล", pre: "เกิดครั้งแรก", post: "ได้", mem:[10,[19,23],26,27]},
    {name: "แก่สังเสทชะบุคคลและโอปปติกะกามบุคคล ในปฏิสนธิกาล", pre: "ขาดตกบกพร่อง", post: "ได้", noneg:true, mem:[[4,6],13,14]},
    {name: "แก่สังเสทชะบุคคลและโอปปติกะกามบุคคล ในปวัตติกาล", pre: "ขาดตกบกพร่อง", post: "ได้", noneg:true, mem:[]},

    {name: "แก่ปัญจโวการรูปบุคคล ในปฏิสนธิกาล", pre: "เกิดครั้งแรก", post: "ได้", mem:[[0,5],9,11,12,[15,18],24,25]},
    {name: "แก่ปัญจโวการรูปบุคคล ในปวัตติกาล", pre: "เกิดครั้งแรก", post: "ได้", mem:[10,[19,23],26,27]},
    {name: "แก่ปัญจโวการรูปบุคคล ในปฏิสนธิกาล", pre: "ขาดตกบกพร่อง", post: "ได้", noneg:true, mem:[]},
    {name: "แก่ปัญจโวการรูปบุคคล ในปวัตติกาล", pre: "ขาดตกบกพร่อง", post: "ได้", noneg:true, mem:[]},

    {name: "แก่อสัญญบุคคล ในปฏิสนธิกาล", pre: "เกิดครั้งแรก", post: "ได้", mem:[[0,3],9,11,12,16,18,24,25]},
    {name: "แก่อสัญญบุคคล ในปวัตติกาล", pre: "เกิดครั้งแรก", post: "ได้", mem:[26,27]},
    {name: "แก่อสัญญบุคคล ในปฏิสนธิกาล", pre: "ขาดตกบกพร่อง", post: "ได้", noneg:true, mem:[]},
    {name: "แก่อสัญญบุคคล ในปวัตติกาล", pre: "ขาดตกบกพร่อง", post: "ได้", noneg:true, mem:[]},

    {name: "แก่คัพพเสยยกะบุคคล ในปฏิสนธิกาล", pre: "เกิดครั้งแรก", post: "ได้", mem:[[0,3],8,9,[11,18],24,25]},
    {name: "แก่คัพพเสยยกะบุคคล ในปวัตติกาล", pre: "เกิดครั้งแรก", post: "ได้", mem:[[4,7],10,[19,23],26,27]},
    {name: "แก่คัพพเสยยกะบุคคล ในปฏิสนธิกาล", pre: "ขาดตกบกพร่อง", post: "ได้", noneg:true, mem:[13,14]},
    {name: "แก่คัพพเสยยกะบุคคล ในปวัตติกาล", pre: "ขาดตกบกพร่อง", post: "ได้", noneg:true, mem:[[4,6]]}

    //{name: "", mem:[]},
];

const _b = [    //สุอเห. เหมือน ทวิปุ มีใน มนุสส จาตุม เท่านั้น

    {name: "อบายภูมิ 4", set: "อบาย 4", sum:4, e:["นิรยภูมิ", "เปตติวิสยภูมิ", "อสุรภูมิ", "ดิรัจฉานภูมิ"], cino:[29,[38,53],[54,88]], pb:[0], pd:[0], p:[0], ahepu_to:[0,1,2], dvipu_to:[], tipu_to:[], s_to:[], ana_to:[]},
    {name: "มนุสสภูมิ<BR/>จาตุมหาราชิกาภูมิ", set: "มนุษย์, จาตุม", sum:2, e:["มนุสสภูมิ", "จาตุมหาราชิกาภูมิ"], cino:[55,58,61,64,67,70,73,76,79], pb:[[1,6]], pd:[[1,7]], p:[[1,7],[8,11]], ahepu_to:[], dvipu_to:[0,1,2], tipu_to:[0,1,2,3,4,5,6,7, 13,14,15,16], s_to:[1,2,3,4,5, 13,14,15,16], ana_to:[3,4,5,6, 8,9,10,11,12, 13,14,15,16]},
    {name: "สวรรค์บน 5", set: "สวรรค์บน 5", sum:5, e:["ตาวติงสาภูมิ", "ยามาภูมิ", "ดุสิตาภูมิ", "นิมมานรตีภูมิ", "ปรนิมมิตวสวัสตีภูมิ"], cino:[55,58,61,64,67,70,73,76,79], pb:[[2,6]], pd:[[2,7]], p:[[2,7],[8,11]], ahepu_to:[], dvipu_to:[0,1,2], tipu_to:[0,1,2,3,4,5,6,7, 13,14,15,16], s_to:[1,2,3,4,5, 13,14,15,16], ana_to:[2,3,4,5, 8,9,10,11,12, 13,14,15,16]},

    //3
    {name: "ปฐมฌานภูมิ 3", set: "รูป.ปฐม 3", sum:3, e:["ปาริสัชชา", "ปุโรหิตา", "มหาพรหมา"], cino:[8,9,[16,21],[38,45],58,61,64,67,70,73,76,79], pb:[[3,6]], pd:[[3,7]], p:[[3,7],[8,11]], ahepu_to:[], dvipu_to:[], tipu_to:[1,2,3,4,5,6, 13,14,15,16], s_to:[3,4,5,6, 13,14,15,16], ana_to:[3,4,5,6, 8,9,10,11,12, 13,14,15,16]},
    {name: "ทุติยฌานภูมิ 3", set: "รูป.ทุติ 3", sum:3, e:["ปริตตาภา", "อัปปมาณาภา", "อาภัสสรา"], cino:[8,9,[16,21],[38,45],55,64,67,70,73,76,79], pb:[[3,6]], pd:[[3,7]], p:[[3,7],[8,11]], ahepu_to:[], dvipu_to:[], tipu_to:[1,2,3,4,5,6, 13,14,15,16], s_to:[4,5,6, 13,14,15,16], ana_to:[4,5,6, 8,9,10,11,12, 13,14,15,16]},
    {name: "ตติยฌานภูมิ 3", set: "รูป.ตติ 3", sum:3, e:["ปริตตสุภา", "อัปปมาณสุภา", "สุภกิณหา"], cino:[8,9,[16,21],[38,45],55,58,61,67,70,73,76,79], pb:[[3,6]], pd:[[3,7]], p:[[3,7],[8,11]], ahepu_to:[], dvipu_to:[], tipu_to:[1,2,3,4,5,6, 13,14,15,16], s_to:[5,6, 13,14,15,16], ana_to:[5,6, 8,9,10,11,12, 13,14,15,16]},
    {name: "เวหัปผลาภูมิ", set: "เวหัป", sum:1, e:["เวหัปผลา"], cino:[8,9,[16,21],[38,45],55,58,61,64,70,73,76,79], pb:[[3,6]], pd:[[3,7]], p:[[3,7]], p:[[3,7],[8,11]], ahepu_to:[], dvipu_to:[], tipu_to:[1,2,3,4,5,6, 13,14,15,16], s_to:[6], ana_to:[6]},
    {name: "อสัญญสัตตาภูมิ", set: "อสัญ", sum:1, e:["อสัญญสัตตาภูมิ"], cino:[[0,120]], pb:[1], pd:[1], p:[1], ahepu_to:[1,2], dvipu_to:[], tipu_to:[], s_to:[], ana_to:[]},

    //8
    {name: "อวิหา", set: "อวิหา", sum:1, e:["อวิหา"], cino:[0,1,4,5,8,9,10,[16,21],[38,45],55,58,61,64,70,73,76,79,[81,83],85,86,[89,91],93,94,[97,99],101,102,[105,107],109,110,[113,115],117,118], pb:[6], pd:[6,7], p:[6,7,11], ahepu_to:[], dvipu_to:[], tipu_to:[], s_to:[], ana_to:[9,10,11,12]},
    {name: "อตัปปา", set: "อตัปปา", sum:1, e:["อตัปปา"], cino:[0,1,4,5,8,9,10,[16,21],[38,45],55,58,61,64,70,73,76,79,[81,83],85,86,[89,91],93,94,[97,99],101,102,[105,107],109,110,[113,115],117,118], pb:[6], pd:[6,7], p:[6,7,11], ahepu_to:[], dvipu_to:[], tipu_to:[], s_to:[], ana_to:[10,11,12]},
    {name: "สุทัสสา", set: "สุทัสสา", sum:1, e:["สุทัสสา"], cino:[0,1,4,5,8,9,10,[16,21],[38,45],55,58,61,64,70,73,76,79,[81,83],85,86,[89,91],93,94,[97,99],101,102,[105,107],109,110,[113,115],117,118], pb:[6], pd:[6,7], p:[6,7,11], ahepu_to:[], dvipu_to:[], tipu_to:[], s_to:[], ana_to:[11,12]},
    {name: "สุทัสสี", set: "สุทัสสี", sum:1, e:["สุทัสสี"], cino:[0,1,4,5,8,9,10,[16,21],[38,45],55,58,61,64,70,73,76,79,[81,83],85,86,[89,91],93,94,[97,99],101,102,[105,107],109,110,[113,115],117,118], pb:[6], pd:[6,7], p:[6,7,11], ahepu_to:[], dvipu_to:[], tipu_to:[], s_to:[], ana_to:[12]},
    {name: "อกนิฏฐา", set: "อกนิฏฐา", sum:1, e:["อกนิฏฐา"], cino:[0,1,4,5,8,9,10,[16,21],[38,45],55,58,61,64,70,73,76,79,[81,83],85,86,[89,91],93,94,[97,99],101,102,[105,107],109,110,[113,115],117,118], pb:[6], pd:[7], p:[6,7,11], ahepu_to:[], dvipu_to:[], tipu_to:[], s_to:[], ana_to:[]},

    //13
    {name: "อากาสานัญจายตนภูมิ", set: "อากา", sum:1, e:["อากาสานัญจายตนภูมิ"], cino:[8,9,[12,27],29,[38,45],[54,68],73,76,79,81,89,97,105,113], pb:[[3,6]], pd:[[3,7]], p:[[3,7],[9,11]], ahepu_to:[], dvipu_to:[], tipu_to:[1, 13,14,15,16], s_to:[13,14,15,16], ana_to:[13,14,15,16]},
    {name: "วิญญาณัญจายตนภูมิ", set: "วิญญา", sum:1, e:["วิญญาณัญจายตนภูมิ"], cino:[8,9,[12,27],29,[38,45],[54,71],76,79,81,89,97,105,113], pb:[[3,6]], pd:[[3,7]], p:[[3,7],[9,11]], ahepu_to:[], dvipu_to:[], tipu_to:[1, 14,15,16], s_to:[14,15,16], ana_to:[14,15,16]},
    {name: "อากิญจัญญายตนภูมิ", set: "อากิญ", sum:1, e:["อากิญจัญญายตนภูมิ"], cino:[8,9,[12,27],29,[38,45],[54,74],79,81,89,97,105,113], pb:[[3,6]], pd:[[3,7]], p:[[3,7],[9,11]], ahepu_to:[], dvipu_to:[], tipu_to:[1, 15,16], s_to:[15,16], ana_to:[15,16]},
    {name: "เนวสัญญานาสัญญายตนภูมิ", set: "เนว", sum:1, e:["เนวสัญญานาสัญญายตนภูมิ"], cino:[8,9,[12,27],29,[38,45],[54,77],81,89,97,105,113], pb:[[3,6]], pd:[[3,7]], p:[[3,7],[9,11]], ahepu_to:[], dvipu_to:[], tipu_to:[1, 16], s_to:[16], ana_to:[16]}
];

const _p = [  // เฉพาะ อรผ มี กิ.ช. // เฉพาะมัคคบุคคล มี มัคคจิต
    {name:"ทุคติปุถุชน",        cino:[29,[38,53],[54,88]],                 bb:[0], bd:[0], b:[0]},
    {name:"สุคติอเหตุกปุถุชน",   cino:[29,38,39,42,43,[46,53],[54,88]],     bb:[1,7], bd:[1,7], b:[1,7]},
    {name:"ทวิเหตุกปุถุชน",     cino:[29,38,39,42,43,[46,53],[54,88]],     bb:[1,2], bd:[1,2], b:[1,2]},
    {name:"ติเหตุกปุถุชน",      cino:[29,[46,53],56,59,62,65,68,71,74,77,80,[81,120]],       bb:[[1,6],[13,16]], bd:[[1,6],[13,16]], b:[[1,6],[13,16]]},
    {name:"โสดาปัตติผลบุคคล",    cino:[0,1,4,5,10,29,[46,53],56,59,62,65,68,71,74,77,80,[81,84],[86,92],[94,100],[102,108],[110,116],[118,120]],       bb:[[1,6],[13,16]], bd:[[1,6],[13,16]], b:[[1,6],[13,16]]},
    {name:"สกทาคามิผลบุคคล",    cino:[0,1,4,5,10,29,[46,53],56,59,62,65,68,71,74,77,80,[81,85],[87,93],[95,101],[103,109],[111,117],[119,120]],       bb:[[1,6],[13,16]], bd:[[1,6],[13,16]], b:[[1,6],[13,16]]},
    {name:"อนาคามิผลบุคคล",     cino:[0,1,4,5,[8,10],29,[46,53],56,59,62,65,68,71,74,77,80,[81,86],[88,94],[96,102],[104,110],[112,118],120],         bb:[[3,6],[8,16]], bd:[[1,6],[8,16]], b:[[1,6],[8,16]]},
    {name:"อรหัตตผลบุคคล",      ci:[[12,29],[38,53],55,56,58,59,61,62,64,65,67,68,70,71,73,74,76,77,79,80,88,96,104,112,120],       bb:[], bd:[[1,6],[8,16]], b:[[1,6],[8,16]]},
    {name:"โสดาปัตติมัคคบุคคล",   ci:[81],       bb:[], bd:[], b:[[1,6]]},
    {name:"สกทาคามิมัคคบุคคล",   ci:[82],       bb:[], bd:[], b:[[1,6],[13,16]]},
    {name:"อนาคามิมัคคบุคคล",    ci:[83],       bb:[], bd:[], b:[[1,6],[13,16]]},
    {name:"อรหัตตมัคคบุคคล",     ci:[84],       bb:[], bd:[], b:[[1,6],[8,16]]}
];

function intersect (a1, a2) {
    var i=0, j=0, aa = [];

    if (typeof(a1[0]) == "boolean") {
        for (;i < a1.length; i++) {
            if (a1[i] && a2[i]) {
                aa.push(i);
            }
        }
    }
    else {
        for (;i < a1.length && j < a2.length; i++, j++) {
            if (a1[i] == a2[j])
                aa.push(a1[i]);
            else {
                while (a1[i] < a2[j] && i < a1.length)
                    i++;
                while (a1[i] > a2[j] && j < a2.length)
                    j++;
            }
        }
    }
    return aa;
}

function explain (a1, ar, sep) {

    if (a1.length==0)
        return "ไม่มี";

    var t="", i, j, aa;
    aa = a1.slice();         // clone array;

    //console.log (aa);


    if (!sep)
        sep = "<BR/>";

    if (typeof(aa[0]) == "boolean") {
        for (i=0, j=0; i<aa.length; j++) {
            if (aa[i])
                aa[i++] = j;
            else
                aa.splice(i,1);
        }
    }

    //console.log (aa);


    if (ar[0].hasOwnProperty("pb")) {// ภูมิ
        for (i=0; i<aa.length; i++) {
            if (aa[i] == 0 && aa[i + 2] == 2) {
                t += "กามภูมิ 11" + sep;
                i += 2;
                continue;
            } else if (aa[i] == 1 && aa[i + 1] == 2) {
                t += "กามสุ 7" + sep;
                i++;
                continue;
            } else if (aa[i] == 3 && aa[i + 8] == 12) {
                t += "รูปภูมิ 15 (-อสัญ)" + sep;
                i += 8;
                continue;
            } else if (aa[i] == 3 && aa[i + 3] == 6) {
                t += "รูปภูมิ 10 (-สุทธ5 อสัญ1)" + sep;
                i += 3;
                continue;
            } else if (aa[i] == 13 && aa[i + 3] == 16) {
                t += "อรูปภูมิ 4" + sep;
                break;
            }

            t += ar[aa[i]].name + sep;
        }
    }
    else if (ar[0].hasOwnProperty("bb")) { //บุคคล
        for (i=0; i<aa.length; i++) {
            if (aa[i] == 0 && aa[i + 3] == 3) {
                t += "ปุถุชน 4" + sep;
                i += 3;
                continue;
            }
            if (aa[i] == 1 && aa[i + 2] == 3) {
                t += "สุคติปุถุชน 3" + sep;
                i += 2;
                continue;
            } else if (aa[i] == 4 && aa[i + 3] == 7) {
                t += "ผลบุคคล 4" + sep;
                i += 3;
                continue;
            } else if (aa[i] == 4 && aa[i + 2] == 6) {
                t += "ผลเสกขบุคคล 3" + sep;
                i += 2;
                continue;
            }

            t += ar[aa[i]].name + sep;
        }
    }
    else if (ar[0].hasOwnProperty("base")) { //รูป
        for (i=0; i<aa.length; i++) {
            if (aa[i] == 0 && aa[i + 27] == 27) {
                t += "รูป 28" + sep;
                i += 27;
                continue;
            }
            if (aa[i] == 0 && aa[i + 17] == 17) {
                t += "นิปผนฺนรูป 18" + sep;
                i += 17;
                continue;
            }
            if (aa[i] == 0 && aa[i + 1] == 2 && aa[i + 11] == 12) {
                t += "วิสยรูป 7" + sep + "ปสาทรูป 5" + sep;
                i += 11;
                continue;
            }
            if (aa[i] == 0 && aa[i + 1] == 2 && aa[i + 2] == 3 && aa[i + 3] == 9 && aa[i + 6] == 12) {
                t += "วิสยรูป 7" + sep;
                i += 6;
                continue;
            }
            if (aa[i] == 0 && aa[i + 3] == 3) {
                t += "มหาภูตรูป 4" + sep;
                i += 3;
                continue;
            }
            if (aa[i] == 4 && aa[i + 4] == 8) {
                t += "ปสาทรูป 5" + sep;
                i += 4;
                continue;
            }
            if (aa[i] == 9 && aa[i + 3] == 12) {
                t += "โคจรรูป 4" + sep;
                i += 3;
                continue;
            }
            if (aa[i] == 13 && aa[i + 1] == 14) {
                t += "ภาวรูป 2" + sep;
                i++;
                continue;
            }
            if (aa[i] == 18 && aa[i + 9] == 27) {
                t += "อนิปฺผนฺนรูป 10" + sep;
                break;
            }
            if (aa[i] == 19 && aa[i + 4] == 23) {
                t += "วิการรูป 5" + sep;
                i += 4;
                continue;
            }
            if (aa[i] == 21 && aa[i + 2] == 23) {
                t += "ลหุตาทิวิการรูป 3" + sep;
                i += 2;
                continue;
            }
            if (aa[i] == 19 && aa[i + 1] == 20) {
                t += "วิญฺญตฺติรูป 2" + sep;
                i++;
                continue;
            }
            if (aa[i] == 24 && aa[i + 3] == 27) {
                t += "ลกฺขณรูป 4" + sep;
                i += 3;
                continue;
            }

            t += ar[aa[i]].name + sep;
        }
    }

    if (t=="")
        return "ไม่มี";

    return t.slice(0, -sep.length);
}

function sumif (aa, ar) {
    var sum=0, i;
    for (i=0; i<aa.length; i++) {
        if (aa[i])
            sum+=ar[i].sum;
    }
    return sum;
}

function count_ci (x, ar) {
    var cnt=[], i;

    //console.log (x);
    for (i=0; i<ar.length; i++) {

        if (ar[i].ci) {
            if (searchin(x, ar[i].ci))
                cnt.push(true);
            else
                cnt.push(false);
        }
        else if (!searchin(x, ar[i].cino))
            cnt.push(true);
        else
            cnt.push(false);

        //console.log (ar[i].name+" : "+cnt[cnt.length-1])
    }
    //console.log (cnt);
    return cnt;
}

function searchin (x, ar) {

    if (typeof (ar) == "undefined")
        return false;

        for (var i = 0; i < ar.length; i++) {
            if ($.isArray(ar[i])) {
                if (x >= ar[i][0] && x <= ar[i][1])
                    return true;
            } else if (x == ar[i])
                return true;
            else if (x < ar[i])
                return false;
        }

    return false;
}


function countin (ar, n, aa, reverse) { // aa = base array


    //if (!ar.hasOwnProperty(prop))
    //return aa;


    if (typeof (ar) == "undefined")
        return aa;
    else if (aa===-1) {
        aa = [];
        for (var k = 0; k < n; k++)
            aa.push(reverse);
    }

    for (var i = 0; i < ar.length ; i++) {
        if ($.isArray(ar[i])) {
            for (var k = ar[i][0]; k <= ar[i][1] && k <n; k++) {
                aa[k] = (!reverse);
            }
        } else if (ar[i]>=n)
            return aa;
        else
            aa[ar[i]] = (!reverse);
    }

    //console.log ("***")
    //console.log (aa);

    return aa;
}
function counta (ar) {

    //console.log ("**counta**");
    //console.log ("**counta**");

    //console.log (ar);

    if (typeof ar == "undefined" || ar.length == 0 || ar == -1)
        return 0;

    var cnt=0;
    ar.forEach (function (e) {if (e) cnt++;} );

    return cnt;
}


function countin_ci (ob, aa) {

    return countin (ob.cino, 89,
    countin (ob.ci, 89, aa, false),
    true); //*/
}

function searchin_ci (ob, x) {      //
    if (ob.hasOwnProperty("ci")) {
        //console.log ("has property ci");
        if (searchin (x, ob.ci))
            return true;
        else
            return false;
    }
    //console.log ("does not have property ci");
    if (!searchin (x, ob.cino))
        return true;
    return false;
}


const _ong = [
    {name:"เหตุ", e:[["โลภ",3,0],["โทส",4,0],["โมห",2,0],["อโลภ",7,4],["อโทส",7,5],["อโมห",10,0]]}
];

function vedana (a) {

}
function dvara (a) {

}
function vatthu (a) {

}

function emo (a, b, c) {
    if (b=="ru") {

    }
    else if (b=="nib") {

    }
}

function randomise(minNumber, maxNumber) {

    return Math.floor(Math.random() * (maxNumber-minNumber) + minNumber); // la fonction magique

}


function nice(t) {

    //console.log (t);

    if (t.charAt(t.length-2)=="โ")
        return t.substring(0, t.length-2)+t.charAt(t.length-1);

    if (t.slice(-1)=="ํ")
        return t.slice(0,-1);

    return t;
}

function search_ce (i, j, k, gr) {
    //console.log ("i="+i+" j="+j+" k="+k);

    if (!ci[i].hasOwnProperty(gr))
        return false;

    //var tmp = ci[i].cer.find(mem => mem[0] === ce[j].group);
    var tmp;

    if (gr == "cer")
        tmp = ci[i].cer.find(function (mem) { return  (mem[0] === ce[j].group);} );
    else if (gr == "unc_saha")
        tmp = ci[i].unc_saha.find(function (mem) { return  (mem[0] === ce[j].group);} );
    else //if (gr == "unc_nana")
        tmp = ci[i].unc_nana.find(function (mem) { return  (mem[0] === ce[j].group);} );

    //if (tmp!=null && ( tmp.length==1 || typeof tmp[1].find(e => e===k) != 'undefined') )

    if (tmp!=null) {

        if (tmp.length==1)
            return true;  // มีเจตสิกทุกตัวในกลุ่ม

        if (typeof tmp[1].find(function (e) { return (e===k);}) != 'undefined')
            return 1;   // มีเจตสิกตัวเดียวในกลุ่ม

        return 0; // ตัวเองมีเจตสิกในกลุ่มนี้ แต่ไม่มีเจตสิกนี้
    }
    return false; // ไม่มีเจตสิกในกลุ่มนี้เลย
}

function search_cer (i, j, k) {
    return search_ce (i, j, k, "cer");
}
function search_unc (i, j, k) {
    return (search_ce (i, j, k, "unc_saha") || search_ce (i, j, k, "unc_nana"));
}

function combine_ans (ar, n_ce, ndel_ce) {

    var t="", i, j, ckey=[];

    if (ar.length==1) {
        ckey = key[ar[0]].slice(); // clone array
    }
    else {
        //alert();
        ar.forEach(function (e) {
            //ckey = $.merge(ckey, key[e]);
            ckey = ckey.concat(key[e]);
        });
        ckey.sort(function (a, b) {  return a - b;  });

    }

    for (j=0; j<ckey.length; j++) {
        if (ckey[j]==0) {
            if (ci89 && ckey[j+88]==88) {
                t += "จิต 89<BR/>";
                break;
            }
            if (ckey[j+80]==80) {
                t += "โลกี 81<BR/>";
                j+=80;
                continue;
            }
            if (ckey[j+53]==53) {
                t += "กาม 54<BR/>";
                j+=53;
                continue;
            }
            if (ckey[j+29]==29) {
                t += "อโสภณ 30<BR/>";
                j+=29;
                continue;
            }
            if (ckey[j+11]==11) {
                t += "อกุ 12<BR/>";
                j+=11;
                continue;
            }
            if (ckey[j+7]==7) {
                t += "โล 8<BR/>";
                j+=7;
                continue;
            }
            if (ckey[j+3]==3) {
                t += "โลโส 4<BR/>";
                j+=3;
                continue;
            }
            if (ckey[j+3]==5) {
                t += "โลสํ 4<BR/>";
                j+=3;
                continue;
            }
            if (ckey[j+3]==6) {
                t += "โล.อสํ 4<BR/>";
                j+=3;
                continue;
            }

        }
        else if (ckey[j]==1 && ckey[j+3]==7) {
            t += "โล.สสํ 4<BR/>"
            j += 3;
            continue;
        }
        else if (ckey[j]==2 && ckey[j+3]==7) {
            t += "โลวิป 4<BR/>"
            j += 3;
            continue;
        }
        else if (ckey[j]==4 && ckey[j+3]==7) {
            t += "โลอุ 4<BR/>"
            j += 3;
            continue;
        }
        else if (ckey[j]==8 && ckey[j+1]==9) {
            t += "โท 2<BR/>"
            j += 1;
            continue;
        }
        else if (ckey[j]==10 && ckey[j+1]==11) {
            t += "โม 2<BR/>"
            j += 1;
            continue;
        }
        else if (ckey[j]==12) {
            if (ckey[j+17]==29) {
                t += "อเห 18<BR/>";
                j += 17;
                continue;
            }
            if (ckey[j+9]==21) {
                t += "ทฺวิ 10<BR/>";
                j += 9;
                continue;
            }
            if (ckey[j+3]==15) {
                t += "จัก 2 โส 2<BR/>";
                j += 3;
                continue;
            }
        }

        else if (ckey[j]==22 && ckey[j+2]==24) {
            t += "มโนธาตุ 3<BR/>";
            j += 2;
            continue;
        }

        else if (ckey[j]==25 && ckey[j+2]==27) {
            t += "สนฺตี 3<BR/>";
            j += 2;
            continue;
        }

        else if (ckey[j]==30) {
            if (ckey[j+51]==81) {
                t += "โสภณ 59<BR/>";
                break;
            }
            if (ckey[j+7]==37) {
                t += "มกุ 8<BR/>"
                j += 7;
                continue;
            }
            if (ckey[j+3]==35) {
                t += "มกุสํ 4<BR/>";
                j += 3;
                continue;
            }
            if (ckey[j+3]==33) {
                t += "มกุโส 4<BR/>";
                j += 3;
                continue;
            }
        }
        else if (ckey[j]==32 && ckey[j+3]==37) {
            t += "มกุวิปฺ 4<BR/>";
            j += 3;
            continue;
        }
        else if (ckey[j]==34 && ckey[j+3]==37) {
            t += "มกุอุ 4<BR/>";
            j += 3;
            continue;
        }
        else if (ckey[j]==38) {
            if (ckey[j+7]==45) {
                t += "มวิ 8<BR/>";
                j += 7;
                continue;
            }
            if (ckey[j+3]==43) {
                t += "มวิสํ 4<BR/>";
                j += 3;
                continue;
            }
            if (ckey[j+3]==41) {
                t += "มวิโส 4<BR/>";
                j += 3;
                continue;
            }
        }
        else if (ckey[j]==40 && ckey[j+3]==45) {
            t += "มวิวิปฺ 4<BR/>";
            j += 3;
            continue;
        }
        else if (ckey[j]==42 && ckey[j+3]==45) {
            t += "มวิอุ 4<BR/>";
            j += 3;
            continue;
        }
        else if  (ckey[j]==46) {
            if (ckey[j+7]==53) {
                t += "มกิ 8<BR/>";
                j += 7;
                continue;
            }
            if (ckey[j+3]==51) {
                t += "มกิสํ 4<BR/>";
                j += 3;
                continue;
            }
            if (ckey[j+3]==49) {
                t += "มกิโส 4<BR/>";
                j += 3;
                continue;
            }
        }
        else if (ckey[j]==48 && ckey[j+3]==53) {
            t += "มกิวิปฺ 4<BR/>";
            j += 3;
            continue;
        }
        else if (ckey[j]==50 && ckey[j+3]==53) {
            t += "มกิอุ 4<BR/>";
            j += 3;
            continue;
        }
        else if  (ckey[j]==54) {
            if (ci89 && ckey[j+34]==88) {
                t += "ฌานจิตฺ 35<BR/>";
                break;
            }
            if (ckey[j+26]==80) {
                t += "มหคฺคต 27<BR/>";
                j += 26;
                continue;
            }
            if (ckey[j+14]==68) {
                t += "รูปฌาน 15<BR/>";
                j += 14;
                continue;
            }
            if (ckey[j+2]==56) {
                t += "รูปปฐมฌาน 3<BR/>";
                j += 2;
                continue;
            }
            if (ckey[j+8]==78) {
                t += "มหคฺ.กุ 9<BR/>";
                j += 8;
                continue;
            }
            if (ckey[j+9]==68) {
                t += "รูปกุ 5 รูปกิ 5<BR/>";
                j += 9;
                continue;
            }
            if (ckey[j+4]==66) {
                t += "รูปกุ 5<BR/>";
                j += 4;
                continue;
            }
        }
        else if (ckey[j]==56) {
            if (ckey[j+8]==80) {
                t += "มหคฺ.กิ 9<BR/>";
                j += 8;
                continue;
            }
            if (ckey[j+4]==68) {
                t += "รูปกิ 5<BR/>";
                j += 4;
                continue;
            }

        }
        else if (ckey[j]==57) {

            if (ckey[j+2]==59) {
                t += "รูปทุติยฌาน 3<BR/>";
                j += 2;
                continue;
            }

        }
        else if (ckey[j]==60) {

            if (ckey[j+2]==62) {
                t += "รูปตติยฌาน 3<BR/>";
                j += 2;
                continue;
            }

        }
        else if (ckey[j]==63) {

            if (ckey[j+2]==65) {
                t += "รูปจตุตฺถฌาน 3<BR/>";
                j += 2;
                continue;
            }
        }
        else if (ckey[j]==66) {

            if (ckey[j+14]==80) {
                t += "มหคฺคตปญฺจมฌาน 15<BR/>";
                j += 14;
                continue;
            }

            if (ckey[j+2]==68) {
                t += "รูปปญฺจมฌาน 3<BR/>";
                j += 2;
                continue;
            }
        }
        else if (ckey[j]==69) {
            if (ckey[j + 11] == 80) {
                t += "อรูปฌาน 12<BR/>";
                j += 11;
                continue;
            }
            if (ckey[j + 7] == 80) {
                t += "อรูป.กุ 4 อรูป.กิ 4<BR/>";
                j += 7;
                continue;
            }
            if (ckey[j + 3] == 78) {
                t += "อรูป.กุ 4<BR/>";
                j += 3;
                continue;
            }
            if (ckey[j + 2] == 71) {
                t += "อากา 3<BR/>";
                j += 2;
                continue;
            }
        }
        else if (ckey[j]==71) {

            if (ckey[j + 3] == 80) {
                t += "อรูป.กิ 4<BR/>";
                j += 3;
                continue;
            }
        }
        else if (ckey[j]==72) {

            if (ckey[j + 2] == 74) {
                t += "วิญฺญา 3<BR/>";
                j += 2;
                continue;
            }
        }
        else if (ckey[j]==75) {

            if (ckey[j + 2] == 77) {
                t += "อากิญฺ 3<BR/>";
                j += 2;
                continue;
            }
        }
        else if (ckey[j]==78) {

            if (ckey[j + 2] == 80) {
                t += "เนว 3<BR/>";
                j += 2;
                continue;
            }
        }
        else if (ckey[j]==81) {
            if (ci89 && ckey[j+7]==88) {
                t += "โลกุตฺ 8<BR/>";   // กรณีนี้สำคัญ เพราะบางทีมีแค่ โสมัค แต่นับ โลกุต 8 เลย
                break;
            }
            if (ckey[j+7]==88) {
                t += "โลกุตฺตรปฐมฌาน 8<BR/>";
                j += 7;
                continue;
            }
            if (ci89 && ckey[j+3]==84) {
                t += "มคฺ 4<BR/>";
                j += 3;
                continue;
            }
        }
        else if (ckey[j]==85) {

            if (ci89 && ckey[j+3]==88) {
                t += "ผล 4<BR/>";
                j += 3;
                break;
            }
        }
        else if (ckey[j]==89) {

            if (ckey[j+7]==96) {
                t += "โลกุตฺตรทุติยฌาน 8<BR/>";
                j += 7;
                continue;
            }
        }
        else if (ckey[j]==97) {

            if (ckey[j+7]==104) {
                t += "โลกุตฺตรตติยฌาน 8<BR/>";
                j += 7;
                continue;
            }
        }
        else if (ckey[j]==105) {

            if (ckey[j+7]==112) {
                t += "โลกุตฺตรจตุตฺถฌาน 8<BR/>";
                j += 7;
                continue;
            }
        }
        else if (ckey[j]==113) {

            if (ckey[j+7]==120) {
                t += "โลกุตฺตรปญฺจมฌาน 8<BR/>";
                break;
            }
        }


        t+= (ci89 && ci[ckey[j]].hasOwnProperty("nn89"))? ci[ckey[j]].nn89+" 1<BR/>" : ci[ckey[j]].nn+" 1<BR/>";
    }

    if (n_ce)
        t+="เจ "+(n_ce-ndel_ce);
    if (ndel_ce)
        t+=" (-"+ndel_ce+") ที่ประกอบ";

    return t;

}

function combine_ans2 (ar) {
    var i, arr = [];
    for (i=0; i<ar.length; i++) {
        if (ar[i])
            arr.push(i);
    }

    //console.log ("**combine_ans2**");
    //console.log (arr);

    key.push (arr.slice());
    return combine_ans([0]);
}