var     pattern_ID, mode_ID, mode_group, subpattern_ID,
    total_right_count, total_wrong_count, total_miss_count,
    ans_count,
    right_column=0,
    n_vibhatti_ans = new Array (8), n_vibhatti_ans_boo = new Array (8);

var start_timer,  SecondsCountDown = 100, Timer, Q_timer, Whiten=new Array();

var subpattern_list = [

    [0,,"ปุลฺลิงฺคนาม","อ","ปุริส"],
    [1,,"ปุลฺลิงฺคนาม","อ","มน"],
    [2,3,"ปุลฺลิงฺคนาม","อ","คุณวนฺตุ"], //หิมวนฺตุ
    [4, ,"ปุลฺลิงฺคนาม","อ","สติมนฺตุ"],
    [5,,"ปุลฺลิงฺคนาม","อ","คจฺฉนฺต"],
    [6,,"ปุลฺลิงฺคนาม","อ","ภวนฺต"],
    [7,,"ปุลฺลิงฺคนาม","อ","ภทนฺต"],
    [8,,"ปุลฺลิงฺคนาม","อ","สนฺต"],
    [9,,"ปุลฺลิงฺคนาม","อ","ราช"],
    [10,,"ปุลฺลิงฺคนาม","อ","พฺรหฺม"],
    [11,,"ปุลฺลิงฺคนาม","อ","อตฺต"],
    [12,,"ปุลฺลิงฺคนาม","อ","สข"],
    [13,,"ปุลฺลิงฺคนาม","อ","อาตุม"],
    [14,,"ปุลฺลิงฺคนาม","อ","ปุม"],
    [15,,"ปุลฺลิงฺคนาม","อ","ยุว"],
    [16,,"ปุลฺลิงฺคนาม","อา","สา"],
    [17,18,"ปุลฺลิงฺคนาม","อิ","อคฺคิ"],
    [19,,"ปุลฺลิงฺคนาม","อี","ทณฺฑี"],
    [20,21,"ปุลฺลิงฺคนาม","อุ","ภิกฺขุ"], //ครุ
    [22,,"ปุลฺลิงฺคนาม","อุ","เหตุ"],
    [23,,"ปุลฺลิงฺคนาม","อุ","ชนฺตุ"],
    [24,,"ปุลฺลิงฺคนาม","อุ","สตฺถุ"],
    [25,,"ปุลฺลิงฺคนาม","อุ","กตฺตุ"],
    [26,,"ปุลฺลิงฺคนาม","อุ","สกมนฺธาตุ"],
    [27,,"ปุลฺลิงฺคนาม","อุ","ปิตุ"],
    [28,,"ปุลฺลิงฺคนาม","อู","อภิภู"],
    [29,,"ปุลฺลิงฺคนาม","อู","สหภู"],
    [30,,"ปุลฺลิงฺคนาม","อู","สพฺพญฺญู"],
    [31,,"ปุลฺลิงฺคนาม","โอ","โค"],

    [32,,"อิตฺถิลิงฺคนาม","อา","กญฺญา"],
    [33,,"อิตฺถิลิงฺคนาม","อา","อมฺมา"],
    [34,35,"อิตฺถิลิงฺคนาม","อิ","รตฺติ"],
    [36, ,"อิตฺถิลิงฺคนาม","อี","อิตฺถี"], //+คาวี
    [37,,"อิตฺถิลิงฺคนาม","อี","นที"],
    [38,,"อิตฺถิลิงฺคนาม","อี","ปุถวี"],
    [39,,"อิตฺถิลิงฺคนาม","อี","โปกฺขรณี"],
    [40,,"อิตฺถิลิงฺคนาม","อุ","ยาคุ"],
    [41,,"อิตฺถิลิงฺคนาม","อุ","มาตุ"],
    [42,,"อิตฺถิลิงฺคนาม","อู","ชมฺพู"],
    [31,,"อิตฺถิลิงฺคนาม","โอ","โค"],

    [43,,"นปุํสกลิงฺคนาม","อ","จิตฺต"],
    [44,,"นปุํสกลิงฺคนาม","อ","กมฺม"],
    [45,,"นปุํสกลิงฺคนาม","อ","ถาม"],
    [46,,"นปุํสกลิงฺคนาม","อ","อทฺธ"],
    [47,,"นปุํสกลิงฺคนาม","อ","คุณวนฺตุ"],
    [48,,"นปุํสกลิงฺคนาม","อ","คจฺฉนฺต"],
    [49,,"นปุํสกลิงฺคนาม","อา","อสฺสทฺธา"],
    [50,,"นปุํสกลิงฺคนาม","อา","มุขนาสิกา"],
    [51,,"นปุํสกลิงฺคนาม","อิ","อฏฺฐิ"],
    [52,,"นปุํสกลิงฺคนาม","อี","สุขการี"],
    [53,,"นปุํสกลิงฺคนาม","อุ","อายุ"],
    [54,,"นปุํสกลิงฺคนาม","อู","โคตฺรภู"],
    [55,,"นปุํสกลิงฺคนาม","โอ","จิตฺตโค"],


    [56,,"สพฺพนาม", "", "สพฺพ (ปุ)"],
    [57,,"สพฺพนาม", "", "สพฺพา (อิ)"],
    [58,,"สพฺพนาม", "", "สพฺพ (นปุ)"],

    [59,,"สพฺพนาม", "", "กตรกตม (ปุ)"],
    [60,,"สพฺพนาม", "", "กตรกตมา (อิ)"],
    [61,,"สพฺพนาม", "", "กตรกตม (นปุ)"],

    [62,,"สพฺพนาม", "", "ปุพฺพ (ปุ)"],
    [63,,"สพฺพนาม", "", "ปุพฺพา (อิ)"],
    [64,,"สพฺพนาม", "", "ปุพฺพ (นปุ)"],


    [65,,"สพฺพนาม", "", "ทกฺขิณปุพฺพา (อิ)"],

    [66,,"สพฺพนาม", "", "ย (ปุ)"],
    [67,,"สพฺพนาม", "", "ยา (อิ)"],
    [68,,"สพฺพนาม", "", "ย (นปุ)"],

    [69,,"สพฺพนาม", "", "ต (ปุ)"],
    [70,,"สพฺพนาม", "", "ตา (อิ)"],
    [71,,"สพฺพนาม", "", "ต (นปุ)"],

    [72,,"สพฺพนาม", "", "เอต (ปุ)"],
    [73,,"สพฺพนาม", "", "เอตา (อิ)"],
    [74,,"สพฺพนาม", "", "เอต (นปุ)"],

    [75,,"สพฺพนาม", "", "อญฺญา (อิ)"],

    [76,,"สพฺพนาม", "", "อิม (ปุ)"],
    [77,,"สพฺพนาม", "", "อิมา (อิ)"],
    [78,,"สพฺพนาม", "", "อิม (นปุ)"],


    [79,,"สพฺพนาม", "", "อมุ (ปุ)"],
    [80,,"สพฺพนาม", "", "อมุ (อิ)"],
    [81,,"สพฺพนาม", "", "อมุ (นปุ)"],

    [82,,"สพฺพนาม", "", "กึ (ปุ)"],
    [83,,"สพฺพนาม", "", "กึ (อิ)"],
    [84,,"สพฺพนาม", "", "กึ (นปุ)"],

    [85,,"สพฺพนาม", "", "กึ+จิ (ปุ)"],
    [86,,"สพฺพนาม", "", "กึ+จิ (อิ)"],
    [87,,"สพฺพนาม", "", "กึ+จิ (นปุ)"],

    [88,,"สพฺพนาม", "", "ย+กึ+จิ (ปุ)"],
    [89,,"สพฺพนาม", "", "ย+กึ+จิ (อิ)"],
    [90,,"สพฺพนาม", "", "ย+กึ+จิ (นปุ)"],

    [91,,"สพฺพนาม", "", "เอก (ปุ)"],
    [92,,"สพฺพนาม", "", "เอก (อิ)"],
    [93,,"สพฺพนาม", "", "เอก (นปุ)"],

    [94,,"สพฺพนาม", "", "อุภ"],
    [95,,"สพฺพนาม", "", "ทฺวิ"],

    [96,,"สพฺพนาม", "", "ติ (ปุ)"],
    [97,,"สพฺพนาม", "", "ติ (อิ)"],
    [98,,"สพฺพนาม", "", "ติ (นปุ)"],

    [99,,"สพฺพนาม", "", "จตุ (ปุ)"],
    [100,,"สพฺพนาม", "", "จตุ (อิ)"],
    [101,,"สพฺพนาม", "", "จตุ (นปุ)"],

    [102,,"สพฺพนาม", "", "ตุมฺห"],
    [103,,"สพฺพนาม", "", "อมฺห"],


    [104,,"สงฺขฺยา", "", "ปญฺจ"],
    [105,,"สงฺขฺยา", "", "กติ"],
    [106,,"สมาส", "", "อุปนคร"],
    [107,,"สมาส", "", "ติโลก"]

];

var mode_list = ["ไม่จับเวลา", "100 วิ สู่เส้นชัย", "ข้อละ 3 วิ","ข้อละ 5 วิ", "ข้อละ 10 วิ"];

function rupa (n, vibhatti) {
    if (vibhatti.charAt(0) == "-")
        return n.substring(0,n.length-1) + vibhatti.charAt(1) + n.substr(n.length-1,1) + vibhatti.substring(2,vibhatti.length);
    if (vibhatti=="X")
        return "-";
    return n + vibhatti;
}

function padamala (n, vi, va) {

    var vibhatti = vi_rupa[subpattern_ID][vi][va];

    if (jQuery.isArray(vibhatti))
        vibhatti = vibhatti[randomise(0,vi_rupa[subpattern_ID][vi][va].length-1)];

    if (vi == 0)
        return vibhatti;

    return rupa (n, vibhatti);
}



function randomise(minNumber, maxNumber) {

    return Math.floor(Math.random() * (maxNumber-minNumber + 1) + minNumber); // la fonction magique

}

function GenderFromVocabList (i, isSpecific) {

    //if (isSpecific) {
        if (i == 31) // โค
            return "<SPAN style=color:blue>ปุ</SPAN>, <SPAN style=color:deeppink>อิตฺ</SPAN>";

        if (i < 32)
            return "<SPAN style=color:blue>ปุ</SPAN>";
        if (i < 43)
            return "<SPAN style=color:deeppink>อิตฺ</SPAN>";
        if (i < 56)
            return "<SPAN style=color:darkviolet>นปุ</SPAN>";

        var tmpo;

        if (i < 65) tmpo = 1;
        else if (i == 65) tmpo = 2;
        else if (i<76) tmpo = 0;
        else if (i<94) tmpo = 2;
        else if (i<96) return "<SPAN style=color:blue>ติ</SPAN><SPAN style=color:deeppink>ลิงฺ</SPAN><SPAN style=color:darkviolet>ค</SPAN>";
        else if (i<102) tmpo = 0;
        else if (i<104) return "<SPAN style=color:darkgrey>อลิงฺค</SPAN>";
        else if (i<106) return "<SPAN style=color:blue>ติ</SPAN><SPAN style=color:deeppink>ลิงฺ</SPAN><SPAN style=color:darkviolet>ค</SPAN>";
        else tmpo = 2 - i;


    switch ((i+tmpo)%3) { //สพพนามเป็นต้นไป

            case 0: return "<SPAN style=color:blue>ปุ</SPAN>";
            case 1: return "<SPAN style=color:deeppink>อิตฺ</SPAN>";
            default: return "<SPAN style=color:darkviolet>นปุ</SPAN>";

            //return "<SPAN style=color:blue>ติ</SPAN><SPAN style=color:deeppink>ลิงฺ</SPAN><SPAN style=color:darkviolet>ค</SPAN>";

        }
    //}


    }


        //if (i == 2 || i == 5) // คุณวนฺตุ คจฺฉนฺต
            //return "<SPAN style=color:blue>ปุ</SPAN>, <SPAN style=color:darkviolet>นปุ</SPAN>";
    //}

    //if (i < 46)
        //return "<SPAN style=color:grey>อลิงฺค</SPAN>";





function n_vibhatti_init () {



    //console.log("F1");

    var i, j, k, r_vi = randomise(0, 7), r_va = randomise(0, 1), Xpattern_ID, noun, meaning, gender, key="-";

    right_column=0;



    var vocab_list = [

        /*0*/
        [["ปุริส", ["บุรุษ", "บุคคล"]], ["สุร", "เทวดา"], ["อุรค", "งู"], ["คนฺธพฺพ", "คนธรรพ์"], ["ปิสาจ", "ปีศาจ"], ["สีห", "ราชสีห์"], ["กจฺฉป", "เต่า"], ["อสฺส", "ม้า"], ["โลก", "โลก"], ["จาค", "การสละ"], ["คาม", "หมู่บ้าน"], ["ธมฺม", ["ธรรม", "บุญกุศล"]], ["โอฆ", "ห้วงน้ำ"],
            ["อสุร", "อสูร"], ["นาค", ["พญานาค,ช้าง"]], ["กินฺนร", "กินนร"], ["เปต", "เปรต"], ["พฺยคฺฆ", "เสือโคร่ง"], ["ตรจฺฉ", "หมาป่า"], ["โสณ", "สุนัข"], ["นิลย", "บ้าน"], ["โยค", ["การประกอบ,สูตร"]], ["นิคม", ["นิคม", "ตำบล"]], ["กาม", ["กาม", "ความใคร่"]], ["โฆส", "เสียงก้อง"],
            ["นร", "คน"], ["ยกฺข", ["ยักษ์", "เทวดา"]], ["มนุสฺส", "มนุษย์"], ["มาตงฺค", "ช้าง"], ["อจฺฉ", "หมี"], ["มิค", "เนื้อ"], ["อาโลก", "แสงสว่าง"], ["อนิล", "ลม"], ["วายาม", "ความพยายาม"], ["อาคม", ["การมา", "พระปริยัติธรรม"]], ["สํฆ", ["พระสงฆ์", "หมู่"]], ["ปฏิฆ", "ความเคียดแค้น"]],

        /*1*/
        [["มน", "ใจ"], ["วจ", "คำพูด"], ["วย", "วัย"], ["เตช", "เดช"], ["ตป", ["ตบะ", "ความเพียร"]], ["เจต", "ใจ"], ["ตม", "ความมืด"], ["ยส", "ยศ"], ["อย", "เหล็ก"], ["ปย", "น้ำนม"], ["สิร", "ศีรษะ"], ["ฉนฺท", ["คัมภีร์ฉันท์", "ความพอใจ", "อำนาจ"]], ["สร", "สระน้ำ"],
            ["อุร", "อก"], ["รห", "ที่ลับ"], ["อห", "วัน"]],

        /*2*/
        [["คุณว", "ผู้มีคุณ"], ["คณว", "ผู้มีหมู่"], ["กุลว", "ผู้มีตระกูลดี"], ["พลว", "ผู้มีกำลัง"], ["ยสว", "ผู้มียศ"], ["ธนว", "ผู้มีทรัพย์"], ["ผลว", "ต้นไม้อันมีผล"], ["สีลว", "ผู้มีศีล"], ["ปญฺญว", "ผู้มีปัญญา"], ["ภคว", "พระผู้มีพระภาค, ผู้มีโชค"], ["สุตว", "ผู้มีการได้ยินได้ฟังมาก"]],

        /*3*/
        [["หิมว", "ภูเขาหิมพานต์"], ["ธิติม", "ผู้มีความตั้งมั่น"], ["คติม", "ผู้มีปัญญา"], ["มติม", "ผู้มีปัญญา"], ["มุติม", "ผู้มีปัญญา"], ["มุตฺติม", "ผู้มีปัญญา"], ["ชุติม", "ผู้มีรัศมี"], ["สิริม", "ผู้มีสิริ"], ["หิริม", "ผู้มีความละอาย"], ["ถุติม", "ผู้มีการสรรเสริญ"], ["รติม", "ผู้มีความยินดี"], ["ยติม", "ผู้มีความเพียร"], ["สุจิม", "ผู้มีความสะอาด"], ["กลิม", "ผู้มีโทษ"], ["พลิม", "ผู้มีพลีกรรม"],
            ["กสิม", "ผู้มีการไถ"], ["รุจิม", "ผู้มีความชอบใจ"], ["พุทฺธิม", "ผู้มีปัญญา"], ["จกฺขุม", "ผู้มีปัญญาจักษุ"], ["เหตุม", "ผู้มีเหตุ"], ["เสตุม", "ผู้มีสะพาน"], ["เกตุม", "ผู้มีธง"], ["ราหุม", "ผู้มีราหู"], ["ภาณุม", "ผู้มีแสงสว่าง"], ["ขาณุม", "ป่าอันมีตอ"], ["วิชฺชุม", "ท้องฟ้าอันมีสายฟ้า"]],

        /*4*/
        [["สติม", "ผู้มีสติ"], ["พนฺธุม", "ผู้มีพวกพ้อง"]],

        /*5*/
        [["คจฺฉ", "ผู้ไปอยู่"], ["มห", "ผู้บูชาอยู่"], ["จร", "ผู้เที่ยวไปอยู่"], ["ติฏฺฐ", "ผู้ยืนอยู่"], ["ทท", "ผู้ให้อยู่"], ["ภุญฺช", "ผู้บริโภคอยู่"], ["สุณ", "ผู้ฟังอยู่"], ["ปจ", "ผู้หุงอยู่"], ["ชย", "ผู้ชนะอยู่"], ["ชีร", "ผู้แก่อยู่"], ["จว", ["ผู้ตายอยู่", "ผู้เคลื่อน"]], ["มีย", "ผู้ตายอยู่"], ["สร", "ผู้ระลึกถึงอยู่"], ["กุพฺพ", "ผู้กระทำอยู่"], ["ชป", "ผู้สวดอยู่"], ["วช", "ผู้ไปอยู่"]],

        /*6*/
        [["", ["ผู้เจริญ", "ท่าน"]]],  //ภวนฺต

        /*7*/
        [["", ["ผู้เจริญ", "ท่าน"]]],  //ภทนฺต

        /*8*/
        [["", ["มีอยู่", "สัตบุรุษ", "ผู้เจริญ", "ผู้อ่อนล้า"]]],  //สนฺต

        /*9*/
        [["", "พระราชา"]],  //ราช


        [["พฺรหฺม", "พรหม"]],

        [["อตฺต", ["ตน", "จิต", "สภาวธรรม", "ปรมาตมัน"]]],


        [["สข", "เพื่อน"]],


        [["อาตุม", "ตน"]],

        /*14*/
        [["ปุม", "ผู้ชาย"]],

        /*15*/
        [["ยุว", "ชายหนุ่ม"], ["มฆว", ["พระอินทร์", "ท้าวสักกะ"]]],

        /*16*/
        [["ส", "สุนัข"]],

        /*17*/
        [["อคฺค", "ไฟ"]],

        /*18*/
        [["โชต","ไฟ"], ["ปาณ","ฝ่ามือ"], ["คณฺฐ",["ศัพท์ยาก","ปม"]], ["มุฏฺฐ","กำมือ"], ["กุจฺฉ","ท้อง"], ["วตฺถ","กระเพาะปัสสาวะ"], ["สาล","ข้าวสาลี"], ["วีห","ข้าวเปลือก"], ["พฺยาธ","โรค"], ["โอธ","เขตแดน"], ["โพธ","ต้นโพธิ์"], ["สนฺธ","การต่อ"], ["ราส",["กอง","หมู่"]], ["เกส","คนฝีกม้าชื่อเกสี"], ["สาต","ภิกษุชื่อว่าสาติ"],
            ["ทีป","เสือดาว"], ["อิส","ฤๅษี"], ["มุน",["พระมุนี","ภิกษุ"]], ["มณ","แก้วมณี"], ["ธน","เสียง"], ["ยต","ภิกษุ"], ["คิร","ภูเขา"], ["รว","ดวงอาทิตย์"], ["กว",["กวี","บัณฑิต"]], ["กป","ลิง"], ["อส","ดาบ"], ["มส","น้ำหมึก"], ["นิธ","ขุมทรัพย์"], ["วิธ","วิธี"], ["อห","งู"], ["กิม","หนอน"], ["ปต",["สามี","เจ้านาย"]],
            ["หร","ทองคำ"], ["อร","ศัตรู"], ["ติม","ปลาใหญ่ชื่อติมิ"], ["กล",["โทษ","บาป"]], ["พล","พลีกรรม"], ["ชลธ","มหาสมุทร"], ["คหปต","คหบดี"], ["อธิปต","อธิบดี"], ["อญฺชล","กระพุ่มมือ"], ["สารถ","สารถี"], ["อติถ","แขกผู้มาเยือน"], ["สมาธ","ความตั้งมั่น"]],

        /*19*/
        [["ทณฺฑ","ผู้มีไม้เท้า"], ["ธมฺม","ผู้มีธรรม"], ["สํฆ","ผู้มีหมู่"], ["ญาณ","ผู้มีญาณ"], ["หตฺถ","ช้างผู้มีงวง"], ["จกฺก","ผู้มีจักร"], ["ปกฺข","นกผู้มีปีก"], ["ทาฐ","สัตว์ผู้มีเขี้ยว"], ["รฏฺฐ","ผู้มีแว่นแคว้น"], ["ฉตฺต","ผู้มีร่ม"], ["มาล","ผู้มีพวงมาลัย"], ["วมฺม","ผู้มีเสื้อเกราะ"], ["โยค","ผู้มีความเพียร"], ["ภาค","ผู้มีส่วน"], ["โภค","ผู้มีโภคทรัพย์"], ["กาม","ผู้มีความใคร่"], ["สาม","ผู้มีทรัพย์"],
            ["ธช","ผู้มีธง"], ["คณ","ผู้มีคณะ"], ["สส","ดวงจันทร์"], ["กุฏฺฐ","ผู้มีโรคเรื้อน"], ["ชฏ","ฤๅษีผู้มีชฎา"], ["ยาน","ผู้มียาน"], ["สุข","ผู้มีความสุข"], ["สิข","นกยูงผู้มีหงอน"], ["ทนฺต","ช้างผู้มีงา"], ["มนฺต","ผู้มีการปรึกษา"], ["กร","ช้างผู้มีงวง"], ["จาค","ผู้มีการบริจาค"], ["กุสล","ผู้มีกุศล"], ["มุสล","ผู้มีสาก"], ["พล","ผู้มีกำลัง"], ["ปาปการ","ผู้ทำบาปเป็นปกติ"], ["ธมฺมจาร","ผู้ประพฤติธรรมโดยปกติ"]],

        /*20*/
        [["ภิกฺข","ภิกษุ"], ["เสต",["สะพาน","เขื่อน"]], ["เกต","ธง"], ["ราห","อสูรชื่อว่าราหู"], ["ภาณ","พระอาทิตย์"], ["ปงฺค","คนเปลี้ย"], ["อุจฺฉ","อ้อย"], ["เวฬ","ไม้ไผ่"], ["มจฺจ","ความตาย"], ["สินฺธ","มหาสมุทร"], ["พนฺธ","พวกพ้อง"], ["เนร","ภูเขาสุเนรุ"], ["เมร","ภูเขาสุเนรุ"], ["สตฺต","ศัตรู"], ["การ","นายช่าง"],
            ["รุร","กวาง"], ["ปฏ","คนฉลาด"]],

        [["คร","ครู"]],


        [["เหต","เหตุ"]],

        /*23*/
        [["ชนฺต","สัตว์"]],

        /*24*/
        [["สตฺถ",["พระศาสดา","ครู"]]],

        /*25*/
        [["กตฺต","ผู้กระทำ"], ["ภตต",["ผู้เลี้ยง","สามี"]], ["วตฺต","ผู้กล่าว"], ["เนต","ผู้นำไป"], ["โสต","ผู้ฟัง"], ["ญาต","ผู้รู้"], ["เชต","ผู้ชนะ"], ["เฉตฺต","ผู้ตัด"], ["เภตฺต",["ผู้ผ่า","ผู้ทำลาย"]], ["ทาต","ผู้ให้"], ["ธาต","ผู้ทรงไว้"], ["นตต","หลาน"], ["โพทฺธ","ผู้รู้"], ["วิญฺญาเปต","ผู้ให้รู้"], ["กาเรต","ผู้ให้ทำ"], ["สาเวต","ผู้ให้ฟัง"]],

        [["สกมนฺธาต","พระเจ้าสกมันธาตุ"], ["มหามนฺธาต","พระเจ้ามหามันธาตุ"]],

        [["ปิต","บิดา"], ["ภาต","พี่/น้องชาย"]],

        /*28*/
        [["อภิภ","ผู้เป็นใหญ่"],["สยมฺภ",["ผู้เป็นเอง","พระพุทธเจ้า"]],["เวสฺสภ","พระเวสสภูพุทธเจ้า"], ["ปราภิภ","ผู้ปกครองบุคคลอื่น"]],

        /*29*/
        [["สหภ","ธรรมอันเป็นไปด้วยกัน"]],

        /*30*/
        [["สพฺพญฺญ","พระสัพพัญญูพุทธเจ้า"], ["มคฺคญฺญ",["ผู้รู้มรรค","ผู้รู้หนทาง"]], ["ธมฺมญฺญ",["ผู้รู้ธรรม","ผู้รู้เหตุ"]], ["อตฺถญฺญ",["ผู้รู้อรรถ","ผู้รู้ผล"]], ["กาลญฺญ","ผู้รู้กาลอันสมควร"], ["รตฺตญฺญ","ผู้รู้ราตรี (ผู้มีอายุมาก)"], ["มตฺตญฺญ","ผู้รู้ประมาณ"], ["กตญฺญ","ผู้รู้คุณที่ผู้อื่นทำแล้ว"], ["ตถญฺญ","ผู้รู้ความจริง"], ["วิญฺญ",["ผู้รู้แจ้ง","ผู้รู้เดียงสา"]], ["วิท",["ผู้รู้","บัณฑิต"]], ["เวทค","ผู้ถึงฝั่งแห่งพระเวท"], ["ปารค",["ผู้ถึงฝั่ง","ผู้เชี่ยวชาญ"]]],

        [["","วัว"]],


        /*32*/
        [["กญฺญ","สาวน้อย"], ["สทฺธ","ความเชื่อ"], ["เมธ","ปัญญา"], ["ปญฺญ","ปัญญา"], ["วิชฺช","ความรู้"], ["จินฺต","ความคิด"], ["มนฺต","ความรู้"], ["วีณ","พิณ"], ["ตณฺห","ตัณหา"], ["อิจฺฉ","ความต้องการ"], ["มุจฺฉ","ความหลง"], ["เอช","ตัณหา"], ["มาย","มารยา"], ["เมตฺต","เมตตา"], ["มตฺต","ประมาณ"], ["สิกฺข","ข้อที่ควรศึกษา"], ["ภิกฺข","อาหาร"],
            ["ชงฺฆ","แข้ง"], ["คีว","คอ"], ["ชิวฺห","ลิ้น"], ["วาจ","คำพูด"], ["ฉาย","เงา"], ["อาส",["ความหวัง","ตัณหา"]], ["คงฺค","แม่น้ำคงคา"], ["นาว","เรือ"], ["คาถ",["คาถา","ร้อยกรอง"]], ["เสน","กองทัพ"], ["เลข","รอยขีดเขียน"], ["สาล","ศาลา"], ["มาล","พวงมาลัย"], ["เวล","เวลา"], ["ปูช","การบูชา"], ["ขิฑฺฑ","การเล่น"], ["ปิปาส","ความกระหาย"], ["เวทน","การเสวยอารมณ์"], ["สญฺญ",["ความจำ","ชื่อ"]], ["เจตน","ความจงใจ"], ["ตสิน","ตัณหา"], ["ปช","หมู่สัตว์"], ["เทวต","เทวดา"], ["วฏฺฏก","นกคุ้ม"], ["โคธ",["เหี้ย","ตะกวด"]], ["พลาก","นกยาง"], ["ปริส","บริษัท"], ["สภ",["สภา","ที่ประชุม"]],
            ["วาลิก","ทราย"], ["สิข",["ยอด","หงอน"]], ["วิสาข","ดาววิสาขา"], ["วิสิข","ถนน"], ["สาข","กิ่งไม้"], ["วจ","ว่านน้ำ"], ["วญฺฌ","หญิงหมัน"], ["ชฏ","ชฎา"], ["ฆฏ","หม้อ"], ["เชฏฺฐ","ดาวช้างใหญ่"], ["โสณฺฑ","งวงช้าง"], ["วาสน","วาสนา"], ["กรุณ","ความสงสาร"], ["วนิต","หญิงสาว"], ["ลต","เถาวัลย์"], ["กถ","คำพูด"], ["นิทฺท","ความหลับ"], ["สุธ",["อาหารทิพย์","ปูนขาว"]], ["นาส","จมูก"], ["ทิส","ทิศ"], ["สึสป","ต้นประดู่ลาย"], ["ปป",["น้ำประปา","บ่อน้ำ"]], ["ปภ","รัศมี"], ["สีม",["สีมา","เขตแดน"]], ["ขม","ความอดทน"], ["ชาย","ภรรยา"], ["ขตฺติย","นางกษัตริย์"], ["สกฺขร","ก้อนกรวด"], ["สุร",["สุรา","เหล้า"]],
            ["โทล","ชิงช้า"], ["ตุล","ตราชั่ง"], ["สิล",["ศิลา","หิน"]], ["ลีล","การเยื้องกราย"], ["ลาล","น้ำลาย"], ["เอล","น้ำลาย"], ["วสุธ",["แผ่นดิน","พสุธา"]], ["กล","ส่วน"], ["วฬว","ม้าตัวเมีย"], ["มูส","เบ้า"], ["คุห","ถ้ำ"]],


        [["อมฺม","แม่"], ["อนฺน","แม่"], ["อมฺพ","แม่"]],

        /*34*/
        [["",["ราตรี","กลางคืน"]]],

        /*35*/
        [["ปตฺต","ส่วนบุญ"], ["ยุตฺต","ความสมควร"], ["วุตฺต","คำอธิบายสูตร"], ["กิตฺต","ชื่อเสียง"], ["มุตฺต","ความหลุดพ้น"], ["ติตฺต","ความอิ่ม"], ["ขนฺต","ความอดทน"], ["กนฺต","ความชอบใจ"], ["สนฺต","พระนิพพาน"], ["ตนฺต","แบบแผน"], ["สิทธ","ความสำเร็จ"], ["สุทฺธ","ความบริสุทธิ์"], ["อิทฺธ", ["ความสำเร็จ","ฤทธิ์"]], ["วุทฺธ","ความเจริญ"], ["พุทฺธ","ความรู้"], ["โพธ","โพธิญาณ"], ["ภูม","แผ่นดิน"],
            ["ชาต","การเกิด"], ["ปีต",["ปีติ","ความอิ่มใจ"]], ["สูต","การเกิด"], ["นนฺท","ความเพลิดเพลิน"], ["สนฺธ","การปฏิสนธิ"], ["สาณ","ผ้าม่าน"], ["โกฏ",["โกฎิ","ปลาย"]], ["ทิฏฐ","ความเห็น"],
            ["วุฑฺฒ","ความเจริญ"], ["ตุฏฺฐ","ความยินดี"], ["ยฏฺฐ","ไม้เท้า"], ["ปาฬ",["ลำดับ","แถว"]], ["อาฬ","ฝั่งน้ำ"], ["นาฬ","ทะนาน"], ["เกฬ","การเล่น"], ["สต","ความระลึกได้"], ["มต","ความรู้"], ["คต","การไป"], ["จุต",["ตาย","เคลื่อน"]], ["ธิต","ความเพียร"], ["ยุวต","หญิงสาว"], ["วิกต","การเปลี่ยนแปลง"], ["รต","ความยินดี"], ["รุจ",["ความชอบใจ","รัศมี"]],
            ["อสน","สายฟ้า"], ["วสน","ผ้า"], ["โอสธ","ดาวประจำรุ่ง"], ["องฺคุล","นิ้วมือ"], ["ธุล", ["ธุลี","ฝุ่นละออง"]], ["ทุนฺทภ","กลองใหญ่"], ["โทณ","รางไม้"], ["อฏว","ป่าดง"], ["ฉว","ผิวหนัง"]],

        /*36*/
        [["อิตฺถ","หญิง"], ["มห","แผ่นดิน"], ["เวตรณ","แม่น้ำเวตรณี"], ["วาป","บึง"], ["ปาฏล","ต้นแคฝอย"], ["กทล","ต้นกล้วย"], ["ฆฏ","หม้อน้ำ"], ["นาร","ผู้หญิง"], ["กุมาร","เด็กหญิง"], ["ตรุณ","หญิงสาว"], ["วารุณ","แม่มด"], ["พฺราหฺมณ","พราหมณี"], ["สข","เพื่อนหญิง"], ["คนฺธพฺพ","หญิงคนธรรพ์"], ["กินฺนร","หญิงกินฺนรี"], ["นาค","นางนาค"], ["เทว","พระราชืนี"], ["ยกฺข","นางยักษ์"],
            ["อช","แม่แพะ"], ["มิค","แม่เนื้อ"], ["วานร","นางลิง"], ["สูกร","แม่หมู"], ["กุกฺกุฏ","แม่ไก่"], ["หํส","นางหงส์"], ["กาก","แม่กา"],
            ["คุณวต","หญิงผู้มีคุณ"], ["คุณวนฺต","หญิงผู้มีคุณ"], ["กุลวต","หญิงผู้มีตระกูลดี"], ["สีลวต","หญิงผู้มีศีล"], ["รูปวต","หญิงผู้มีรูปงาม"], ["สติมต","หญิงผู้มีสติ"], ["โคมต","หญิงผู้มีโค"], ["มหต","หญิงผู้บูชาอยู่"], ["โภต","หญิงผู้เจริญ"], ["ภิกฺขุน","ภิกษุณี"], ["คหปตาน","หญิงนายเรือน"], ["ราชิน","พระราชินี"], ["ทณฺฑิน","หญิงผู้มีไม้เท้า"], ["หตฺถิน","ช้างพัง"], ["เมธาวิน","หญิงผู้มีปัญญา"], ["ตปสฺสิน","หญิงผู้มีตบะ"],["ปิยภาณิน","หญิงผู้มีวาจาไพเราะ"], ["ภยทสฺสาวิน","หญิงผู้เห็นภัย"], ["ภุตฺตาวิน", "หญิงผู้บริโภคแล้ว"], ["ธมฺมจาริน","หญิงผู้ประพฤติธรรมโดยปกติ"], ["ปรจิตฺตวิทุน","หญิงผู้รู้จิตของผู้อื่น"], ["ยกฺขิน","นางยักษิณี"], ["สีหิน","นางสิงโต"],  ["คาว", "แม่วัว"]],



        /*37*/
        [["","แม่น้ำ"]], //นที

        [["","แผ่นดิน"]], //ปุถวี

        [["","สระโบกขรณี"]],

        /*40*/
        [["ยาค","ข้าวต้ม"], ["ธาต","ธาตุ"], ["เธน","แม่โคนม"], ["กาส","หลุม"], ["ททฺท","โรคกลาก"], ["กจฺฉ","โรคหิด"], ["กณฺฑ","โรคเกลื้อน"], ["รชฺช","เชือก"], ["กเรณ","ช้างพัง"], ["ปิยงฺค","ต้นประยงค์"], ["สสฺส", ["แม่ยาย","แม่ผัว"]]],

        /*41*/
        [["มาต","มารดา"], ["ธีต",["ลูกสาว","ธิดา"]], ["ทุหิต",["ลูกสาว","ธิดา"]]],



        /*42*/
        [["ชมฺพ","ต้นหว้า"], ["วธ",["หญิงสาว","สะใภ้"]], ["สรภ","แม่น้ำสรภู"], ["สรพ", ["ตุ๊กแก","จิ้งจก"]], ["สุตน","หญิงผู้มีร่างกายงดงาม"], ["จม","กองทัพ"], ["วามูร","หญิงผู้มีขาอ่อนงาม"]],

        /*43*/



        [["จิตฺต","จิต"], ["ปุญฺญ","บุญ"], ["ปาป","บาป"], ["ผล","ผล"], ["รูป","รูป"], ["สาธน","ความสำเร็จ"], ["โสต","หู"], ["ฆาน","จมูก"], ["สุข","สุข"], ["ทุกฺข","ทุกฺข์"], ["การณ","เหตุ"], ["ทาน","ทาน"], ["สีล","ศีล"], ["ธน","ทรัพย์"], ["โลจน","ดวงตา"], ["มูล",["มูล","ราก","มูลค่า"]], ["กูล","ฝั่งน้ำ"],
            ["พล","กำลัง"], ["ชาล","ข่าย"], ["มงฺคล","มงคล"], ["นฬิน","ดอกบัว"], ["ลิงฺค",["ลิงค์","เพศ"]], ["มุข",["ปาก","หน้า"]], ["องฺค",["ส่วน","อวัยวะ"]], ["ชล","น้ำ"], ["อมฺพุช","ดอกบัว"], ["ปุลิน","ทราย"], ["ธญฺญ","ข้าวเปลือก"], ["หิรญฺญ","เงิน"], ["ปท",["บท","เหตุ","เท้า"]], ["อมต","พระนิพพาน"], ["ปทุม","ดอกบัวแดง"], ["ปณฺณ","ใบไม้"],
            ["สุสาน","ป่าช้า"], ["วน",["ป่า","น้ำ"]], ["อายุธ","อาวุธ"], ["หทย","หัวใจ"], ["จีวร","จีวร"], ["วตฺถ","ผ้า"], ["กุล","ตระกูล"], ["อินฺทฺริย","อินทรีย์"], ["นยน","ดวงตา"], ["วทน","ปาก"], ["ยาน","ยาน"], ["อุทาน","คำอุทาน"], ["โสปาน","บันได"], ["ปาน","น้ำดื่ม"], ["ภวน","บ้าน"], ["ภุวน","โลก"],
            ["โลห","เหล็ก"], ["อลาต","ดุ้นไฟ"], ["ตุณฺฑ","จะงอยปาก"], ["อณฺฑ","ไข่"], ["ปีฐ","ตั่ง"], ["กรณ","เครื่องมือ"], ["มรณ","ความตาย"], ["ญาณ",["ญาณ","ปัญญา"]], ["อารมฺมณ","อารมณ์"], ["อรญฺญ","ป่า"], ["ตาณ","พระนิพพาน"], ["จรณ","การประพฤติ"], ["นคร","เมือง"], ["ตีร","ฝั่งน้ำ"], ["ฉตฺต","ร่ม"], ["ฉิทฺท",["รู","ช่อง","โพรง"]]
        ],



        [["กมฺม",["กรรม","การงาน","การกระทำ"]]],

        [["ถาม" ,"กำลัง"]],

        [["อทฺธ" ,"กึ่ง"]],

        /*47*/
        [2],    //คุณวนฺตุ

        /*48*/
        [5],    //คจฺฉนฺต

        /*49*/
        [["อสฺสทฺธ","ผู้ไม่มีศรัทธา"]],

        [["มุขนาสิก","ปากและจมูก"]],

        /*51*/
        [["อฏฺฐ","กระดูก"], ["สตฺถ","ขาอ่อน"], ["ทธ","นมส้ม"], ["วาร","น้ำ"], ["อกฺข","นัยน์ตา"], ["อจฺฉ","นัยน์ตา"], ["อจฺจ","เปลวไฟ"]],

        /*52*/
        [["สุขการ","อันกระทำซึ่งความสุขโดยปกติ"], ["สีฆยาย","อันไปเร็วโดยปกติ"], ["พฺรหมฺจาร","อันประพฤติซึ่งพรหมจรรย์โดยปกติ"], ["สจฺจวาท","อันกล่าวซึ่งความจริงโดยปกติ"], ["ปาปการ","อันกระทำซึ่งบาปโดยปกติ"], ["ธมฺมจาร","อันประพฤติซึ่งธรรมโดยปกติ"]],

        /*53*/
        [["อาย",["อายุ","ชีวิต"]], ["จกฺข","นัยน์ตา"], ["วส","ทรัพย์"], ["ธน","ธนู"], ["ทาร",["ไม้","ฟืน"]], ["ติป","แร่ดีบุก"], ["มธ","น้ำผึ้ง"], ["หิงฺค","มหาหิงคุ์"], ["สิคฺค","ต้นมะรุม"], ["วตฺถ",["เรื่อง","สิ่งของ"]], ["ชต","ครั่ง"], ["อมฺพ","น้ำ"], ["อสฺส","น้ำตา"]],

        /*54*/
        [["โคตฺรภ","โคตฺรภูจิต"], ["อภิภ","(จิต) ผู้เป็นใหญ่"], ["สยมฺภ","(จิต) ผู้รู้เอง"], ["ธมฺมญฺญ","(จิต) ผู้รู้ธรรม"]],

        /*55*/
        [["จิตฺต","มีวัวด่าง"]],  //จิตฺตโค

        [["สพฺพ", "ทั้งปวง"], ["กตร", "ไหน"], ["กตม", "ไหน"], ["อุภย", "ทั้งสอง"], ["อิตร", "นอกนี้"], ["อญฺญ", "อื่น"], ["อญฺญตร", "อย่างใดอย่างหนึ่ง"], ["อญฺญตม", "อย่างใดอย่างหนึ่ง"]],
        [56],
        [56],

        [["กตรกตม", "ไหนๆ"], ["ทนฺตกตม", "ฟันซี่ไหนๆ"], ["ปุพฺพาปร", ["ทิศตะวันออกและตก","ข้างหน้าและหลัง"]], ["ปุพฺพุตฺตร", "ทิศตะวันออกและทิศเหนือ"], ["อธรุตฺตร", "ทิศเบื้องล่างและเบื้องบน"]],
        [59],
        [59],

        [["ปุพฺพ", "ก่อน"], ["ปร","อื่น, หลัง"], ["อปร","อื่นอีก"], ["ทกฺขิณ","ใต้, ขวา"], ["อุตฺตร","เหนือ, บน"], ["อธร","ภายใต้, เบื้องล่าง"]],
        [62],
        [62],

        [["ทกฺขิณปุพฺพ", "ทิศตะวันออกเฉียงใต้"], ["อุตฺตรปุพฺพ", "ทิศตะวันออกเฉียงเหนือ"]],

        [["ย", "ใด"]],
        [66],
        [66],

        [["", "นั้น"]],
        [69],
        [69],

        [["เอ", ["นั่น", "นี้"]]],
        [72],
        [72],

        [["อญฺญ","อื่น"], ["เอก","หนึ่ง"], ["อิตร","นอกนี้"]],

        [["", "นี้"]],
        [76],
        [76],

        [["", "โน้น"]],
        [79],
        [79],

        [["ก", ["อะไร","ใคร","ไหน"]]],
        [82],
        [82],

        [["ก", ["บางคน","บางอย่าง","ไรๆ"]]],
        [85],
        [85],

        [["ย", ["ทั้งปวง","คนใดคนหนึ่ง","อย่างใดอย่างหนึ่ง"]]],
        [88],
        [88],

        [["เอก", "หนึ่ง"]],
        [91],
        [91],

        [["อุภ", "ทั้งสอง"]],
        [["", "สอง"]],

        [["", "สาม"]],
        [96],
        [96],

        [["", "สี่"]],
        [99],
        [99],

        [["", ["ท่าน", "เธอ", "คุณ", "เจ้า"]]],

        [["", ["ข้าพเจ้า", "ผม", "ดิฉัน"]]],

        [["ปญฺจ", "ห้า"], ["ฉ", "หก"], ["สตฺต", "เจ็ด"], ["อฏฺฐ","แปด"], ["นว","เก้า"], ["ทส","สิบ"]],
        [["กต", "เท่าไร"]],

        [["อุปนคร", "ใกล้เมือง"]],
        [["ติโลก", "สามโลก"]],

        ];
        /*



        /*,
         [["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""],
         ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""], ["",""]] */


    var vocab_suffix = ["", "", "นฺตุ", "นฺตุ", "นฺตุ", "นฺต", "ภวนฺต", "ภทนฺต", "สนฺต", "ราช", "", "", "", "", "", "", "า",
        "ิ", "ี", "ุ", "ุ", "ุ", "ุ", "ุ", "ุ", "ุ", "ุ", "ู", "ู", "ู", "ู", "โค",

        "า", "า","รตฺติ", "ิ", "ี", "ี", "นที", "ุ", "ุ", "ุ", "ู",

        "", "",  "", "", "ุ", "",  "า",  "า", "ิ", "ี", "ุ", "ู", "โค"
    ];

    /*
        "ตุมฺห", "อมฺห",
        "", "", "", "", "", "",
        "", "", "", "ต", "ต", "ต" */



    var vi_rupa = [

        [
            [["", "า"], "า"],            //0 ปุริส 0
            ["-โ", "า"],               //1
            ["ํ", "-เ"],               //2
            ["-เน", ["-เหิ", "-เภิ"]],    //3
            ["สฺส", "านํ"],                //4
            [["า", "มฺหา", "สฺมา"], ["-เหิ", "-เภิ"]],      //5
            ["สฺส", "านํ"],               //6
            [["-เ", "มฺหิ", "สฺมึ"], "-เสุ"],             //7
            ["โภ", "ภวนฺโต"]//8
        ],

        [
            [["", "า"], "า"],              //0 มน 1
            ["-โ", "า"],              //1
            [["-โ","ํ"], "-เ"],              //2
            [["สา", "-เน"], ["-เหิ", "-เภิ"]],    //3
            [["โส", "สฺส"], "านํ"],              //4
            [["า", "มฺหา", "สฺมา"], ["-เหิ", "-เภิ"]],    //5
            [["โส", "สฺส"], "านํ"],              //6
            [["สิ", "-เ", "มฺหิ", "สฺมึ"], "-เสุ"],             //7
            ["เห", "เห"]              //8
        ],

        [
            [["ํ", "", "า"], ["นฺโต", "นฺตา"]], //0 คุณวนฺตุ 2
            ["า", ["นฺโต", "นฺตา"]],     //1
            ["นฺตํ", "นฺเต"],             //2
            [["ตา", "นฺเตน"], ["นฺเตหิ", "นฺเตภิ"]],   //3
            [["โต", "นฺตสฺส"], ["ตํ", "นฺตานํ"]],      //4
            [["ตา", "นฺตา", "นฺตมฺหา", "นฺตสฺมา"], ["นฺเตหิ", "นฺเตภิ"]],   //5
            [["โต", "นฺตสฺส"], ["ตํ", "นฺตานํ"]],      //6
            [["ติ", "นฺเต", "นฺตมฺหิ", "นฺตสฺมึ"], "นฺเตสุ"],            //7
            ["โภ", "ภวนฺโต"]
        ],


        [
            [["ํ", "", "า"], ["นฺโต", "นฺตา"]],           //0 หิมวนฺตุ 3
            [["า", "นฺโต"], ["นฺโต", "นฺตา"]],     //1
            ["นฺตํ", "นฺเต"],             //2
            [["ตา", "นฺเตน"], ["นฺเตหิ", "นฺเตภิ"]],   //3
            [["โต", "นฺตสฺส"], ["ตํ", "นฺตานํ"]],      //4
            [["ตา", "นฺตา", "นฺตมฺหา", "นฺตสฺมา"], ["นฺเตหิ", "นฺเตภิ"]],   //5
            [["โต", "นฺตสฺส"], ["ตํ", "นฺตานํ"]],      //6
            [["ติ", "นฺเต", "นฺตมฺหิ", "นฺตสฺมึ"], "นฺเตสุ"],            //7
            ["โภ", "ภวนฺโต"]      //8
        ],

        [
            [["ํ", "", "า"], ["นฺโต", "นฺตา"]],           //0 สติมนฺตุ & พนฺธุมนฺตุ 4
            [["า", "นฺโต"], ["นฺโต", "นฺตา"]],     //1
            [["ํ", "นฺตํ"], "นฺเต"],             //2
            [["ตา", "นฺเตน"], ["นฺเตหิ", "นฺเตภิ"]],   //3
            [["สฺส", "โต", "นฺตสฺส"], ["ตํ", "นฺตานํ"]],      //4
            [["ตา", "นฺตา", "นฺตมฺหา", "นฺตสฺมา"], ["นฺเตหิ", "นฺเตภิ"]],   //5
            [["สฺส", "โต", "นฺตสฺส"], ["ตํ", "นฺตานํ"]],      //6
            [["ติ", "นฺเต", "นฺตมฺหิ", "นฺตสฺมึ"], "นฺเตสุ"],            //7
            ["โภ", "ภวนฺโต"]        //8
        ],

        [
            [["ํ", "", "า"], ["นฺโต", "นฺตา"]],                       //0 คจฺฉนฺต 5
            [["ํ", "นฺโต"], ["นฺโต", "นฺตา"]],                         //1
            ["นฺตํ", "นฺเต"],                                         //2
            [["ตา", "นฺเตน"], ["นฺเตหิ", "นฺเตภิ"]],                    //3
            [["โต", "นฺตสฺส"], ["ตํ", "นฺตานํ"]],                       //4
            [["ตา", "นฺตา", "นฺตมฺหา", "นฺตสฺมา"], ["นฺเตหิ", "นฺเตภิ"]],   //5
            [["โต", "นฺตสฺส"], ["ตํ", "นฺตานํ"]],                       //6
            [["ติ", "นฺเต", "นฺตมฺหิ", "นฺตสฺมึ"], "นฺเตสุ"],                //7
            ["โภ", "ภวนฺโต"]                                        //8
        ],

        [
            [["โภ", "ภนฺเต", "โภนฺต", "โภนฺตา"], ["โภนฺโต", "ภวนฺโต", "ภวนฺตา"]],                        //0 ภวนฺต 6
            [["ภวํ"], ["โภนฺโต", "ภวนฺโต", "ภวนฺตา"]],      //1
            ["ภวนฺตํ", ["โภนฺเต", "ภวนฺเต"]],              //2
            [["โภตา", "ภวตา", "ภวนฺเตน"], ["ภวนฺเตหิ", "ภวนฺเตภิ"]],            //3
            [["โภโต", "ภวโต", "ภวนฺตสฺส"], ["ภวตํ", "ภวนฺตานํ"]],               //4
            [["โภตา", "ภวตา", "ภวนฺตา", "ภวนฺตมฺหา", "ภวนฺตสฺมา"], ["ภวนฺเตหิ", "ภวนฺเตภิ"]],//5
            [["โภโต", "ภวโต", "ภวนฺตสฺส"], ["ภวตํ", "ภวนฺตานํ"]],               //6
            [["ภวติ", "ภวนฺเต", "ภวนฺตมฺหิ", "ภวนฺตสฺมึ"], "ภวนฺเตสุ"],                      //7
            [,]             //8
        ],

        [
            [["ภทฺทนฺต", "ภทฺทนฺเต", "ภนฺเต", "ภทนฺต", "ภทนฺตา"], ["ภทฺทนฺตา", "ภนฺเต", "ภทนฺตา"]],                        //0 ภวนฺต 6
            [["ภทนฺโต"], ["ภทฺทนฺตา", "ภทนฺตา"]],      //1
            ["ภทนฺตํ", ["ภทฺทนฺเต", "ภทนฺเต"]],              //2
            ["ภทนฺเตน", ["ภทนฺเตหิ", "ภทนฺเตภิ"]],            //3
            ["ภทนฺตสฺส", "ภทนฺตานํ"],               //4
            [["ภทนฺตา", "ภทนฺตมฺหา", "ภทนฺตสฺมา"], ["ภทนฺเตหิ", "ภทนฺเตภิ"]],//5
            ["ภทนฺตสฺส", "ภทนฺตานํ"],               //6
            [["ภทนฺเต", "ภทนฺตมฺหิ", "ภทนฺตสฺมึ"], "ภทนฺเตสุ"],                      //7
            [,]             //8
        ],

        [
            [["สํ", "ส", "สา"], ["สนฺโต", "สนฺตา"]],             //0 สนฺต 7
            [["สํ", "สนฺโต"], ["สนฺโต", "สนฺตา"]],     //1
            ["สนฺตํ", "สนฺเต"],              //2
            [["สตา", "สนฺเตน"], ["สนฺเตหิ", "สพฺภิ"]],     //3
            [["สโต", "สนฺตสฺส"], ["สตํ", "สนฺตานํ"]],      //4
            [["สตา", "สนฺตา", "สนฺตมฺหา", "สนฺตสฺมา"], ["สนฺเตหิ", "สพฺภิ"]],     //5
            [["สโต", "สนฺตสฺส"], ["สตํ", "สนฺตานํ"]],      //6
            [["สติ", "สนฺเต", "สนฺตมฺหิ", "สนฺตสฺมึ"], "สนฺเตสุ"],             //7
            ["โภ", "ภวนฺโต"]      //8
        ],


        [
            [["ราช", "ราชา"], "ราชาโน"],                         //0 ราช 8
            ["ราชา", "ราชาโน"],                        //1
            [["ราชานํ", "ราชํ"], "ราชาโน"],                        //2
            [["รญฺญา", "ราเชน"], ["ราชูหิ", "ราชูภิ", "ราเชหิ", "ราเชภิ"]], //3
            [["รญฺโญ", "ราชิโน"], ["รญฺญํ", "ราชูนํ", "ราชานํ"]],          //4
            ["รญฺญา", ["ราชูหิ", "ราชูภิ", "ราเชหิ", "ราเชภิ"]], //5
            [["รญฺโญ", "ราชิโน"], ["รญฺญํ", "ราชูนํ", "ราชานํ"]],          //6
            [["รญฺเญ", "ราชินิ"], ["ราชูสุ", "ราเชสุ"]],                //7
            ["โภ", "ภวนฺโต"] //8
        ],


        [
            [["", "า"], "าโน"],              //0 พฺรหฺม
            ["า", "าโน"],              //1
            [["านํ", "ํ"], "าโน"],              //2
            ["ุนา", ["-เหิ", "-เภิ"]],    //3
            [["ุโน", "สฺส"], ["านํ", "ูนํ"]],              //4
            ["ุนา", ["-เหิ", "-เภิ"]],     //5
            [["ุโน", "สฺส"], ["านํ", "ูนํ"]],               //6
            ["นิ", "-เสุ"],             //7
            ["โภ", "ภวนฺโต"]              //8
        ],

        [

            [["", "า"], "าโน"],              //0 อตฺต
            ["า", "าโน"],              //1
            [["านํ", "ํ"], "าโน"],              //2
            [["นา", "-เน"], ["เนหิ", "เนภิ"]],    //3
            ["โน", "านํ"],              //4
            ["นา", ["เนหิ", "เนภิ"]],     //5
            ["โน", "านํ"],               //6
            ["นิ", "-เสุ"],             //7
            ["โภ", "ภวนฺโต"]                //8
        ],


        [

            [["", "า", "ิ", "ี", "-เ"], ["าโน", "าโย", "ิโน"]],              //0 สข
            ["า", ["าโน", "าโย", "ิโน"]],              //1
            [["ารํ", "านํ", "ํ"], ["าโน", "าโย", "ิโน"]],              //2
            ["ินา", ["าเรหิ", "าเรภิ", "-เหิ", "-เภิ"]],    //3
            [["ิโน", "ิสฺส"], ["ารานํ", "านํ"]],              //4
            ["ินา", ["าเรหิ", "าเรภิ", "-เหิ", "-เภิ"]],     //5
            [["ิโน", "ิสฺส"], ["ารานํ", "านํ"]],               //6
            ["-เ", ["าเรสุ","-เสุ"]],             //7
            ["โภ", "ภวนฺโต"]                //8
        ],

        [
            [["", "า"], "าโน"],              //0 อาตุม
            ["า", "าโน"],              //1
            [["านํ", "ํ"], "าโน"],              //2
            ["-เน", ["-เหิ", "-เภิ"]],    //3
            ["สฺส", "านํ"],              //4
            [["า","มฺหา","สฺมา"], ["-เหิ", "-เภิ"]],     //5
            ["สฺส", "านํ"],               //6
            [["-เ","มฺหิ","สฺมึ"], "-เสุ"],             //7
            ["โภ", "ภวนฺโต"]              //8
        ],

        [
            ["ํ", "าโน"],              //0 ปุม
            ["า", "าโน"],              //1
            ["ํ", "าโน"],              //2
            [["านา","ุนา","-เน"], ["าเนหิ", "าเนภิ", "-เหิ", "-เภิ"]],    //3
            [["ุโน", "สฺส"], "านํ"],              //4
            [["านา","ุนา","า","มฺหา","สฺมา"], ["าเนหิ", "าเนภิ", "-เหิ", "-เภิ"]],     //5
            [["ุโน", "สฺส"], "านํ"],                //6
            [["าเน","-เ","มฺหิ","สฺมึ"], ["าสุ","-เสุ"]],             //7
            ["เห", "เห"]                //8
        ],



        [

            [["","า","าน","านา"], "านา"],              //0 ยุว
            [["า", "าโน"], ["านา","า"]],              //1
            [["านํ", "ํ"], ["าเน","-เ"]],              //2
            [["านา","-เน","าเนน"], ["าเนหิ", "าเนภิ", "-เหิ", "-เภิ"]],    //3
            [["านสฺส", "สฺส"], ["านานํ","านํ"]],              //4
            [["านา","านมฺหา","านสฺมา"], ["าเนหิ", "าเนภิ", "-เหิ", "-เภิ"]],     //5
            [["านสฺส", "สฺส"], ["านานํ","านํ"]],                 //6
            [["าเน","านมฺหิ","านสฺมึ","-เ","มฺหิ","สฺมึ"], ["าเนสุ","าสุ","-เสุ"]],             //7
            ["เห", "เห"]                //8

        ],


        [
            [["", "า"], "า"],              //0 สา
            ["า", "า"],              //1
            ["ํ", "-เ"],              //2
            ["-เน", ["าหิ", "าภิ"]],    //3
            [["สฺส", "าย"], "านํ"],              //4
            [["า", "มฺหา", "สฺมา"], ["าหิ", "าภิ"]],     //5
            ["สฺส", "านํ"],               //6
            [["-เ", "มฺหิ", "สฺมึ"], "าสุ"],             //7
            ["เห", "เห"]               //8
        ],

        [   //อคฺคิ `
            ["ิ", ["ี", "โย"]],
            [["ินิ","ิ"], ["ี","โย"]],
            ["ึ", ["ี","โย"]],
            ["ินา", ["ีหิ", "ีภิ","ิหิ", "ิภิ"]],
            [["ิโน", "ิสฺส"], ["ีนํ" , "ินํ"]],
            [["ินา", "ิมฺหา", "ิสฺมา"], ["ีหิ", "ีภิ","ิหิ", "ิภิ"]],
            [["ิโน", "ิสฺส"], ["ีนํ" , "ินํ"]],
            [["ิมฺหิ", "ิสฺมึ"], ["ีสุ","ิสุ"]],
            ["เห", "เห"]
        ],

        [   //อคฺคิ 2
            ["ิ", ["ี", "โย"]],
            ["ิ", ["ี","โย"]],
            ["ึ", ["ี","โย"]],
            ["ินา", ["ีหิ", "ีภิ","ิหิ", "ิภิ"]],
            [["ิโน", "ิสฺส"], ["ีนํ" , "ินํ"]],
            [["ินา", "ิมฺหา", "ิสฺมา"], ["ีหิ", "ีภิ","ิหิ", "ิภิ"]],
            [["ิโน", "ิสฺส"], ["ีนํ" , "ินํ"]],
            [["ิมฺหิ", "ิสฺมึ"], ["ีสุ","ิสุ"]],
            ["เห", "เห"]
        ],

        [
            ["ิ", ["ี","ิโน"]],                       //0 ทณฑี
            ["ี", ["ี","ิโน"]],                    //1
            [["ินํ","ึ"], ["ี","ิโน"]],              //2
            ["ินา", ["ีหิ", "ีภิ"]],                 //3
            [["ิโน", "ิสฺส"], "ีนํ" ],               //4
            [["ินา", "ิมฺหา", "ิสฺมา"], ["ีหิ", "ีภิ"]], //5
            [["ิโน", "ิสฺส"], "ีนํ" ],               //6
            [["ินิ","ิมฺหิ", "ิสฺมึ"], "ีสุ"],            //7
            ["โภ", "ภวนฺโต"]                    //8
        ],

        [
            ["ุ", ["ู","เว","โว"]],                                  //0 ภิกขุ
            ["ุ", ["ู","โว"]],                               //1
            ["ุํ", ["ู","โว"]],                               //2
            ["ุนา", ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]],                 //3
            [["ุโน", "ุสฺส"], ["ูนํ" ,"ุนํ"]],                    //4
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]], //5
            [["ุโน", "ุสฺส"], ["ูนํ" ,"ุนํ"]],                    //6
            [["ุมฺหิ", "ุสฺมึ"], ["ูสุ","ุสุ"]],                     //7
            ["โภ", "ภวนฺโต"]                          //8
        ],


        [
            ["ุ", ["ู","เว","โว"]],                                  //0 ครุ
            ["ุ", ["ู","โว","ุโน"]],                               //1
            ["ุํ", ["ู","โว","ุโน"]],                               //2
            ["ุนา", ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]],                 //3
            [["ุโน", "ุสฺส"], ["ูนํ" ,"ุนํ"]],                    //4
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]], //5
            [["ุโน", "ุสฺส"], ["ูนํ" ,"ุนํ"]],                    //6
            [["ุมฺหิ", "ุสฺมึ"], ["ูสุ","ุสุ"]],                     //7
            ["โภ", "ภวนฺโต"]                          //8
        ],

        [
            ["ุ", ["ู","เว","โว"]],                                  //0 เหตุ
            ["ุ", ["ู","โว","ุโย"]],                          //1
            ["ุํ", ["ู","โว","ุโย"]],                          //2
            ["ุนา", ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]],                 //3
            [["ุโน", "ุสฺส"], ["ูนํ" ,"ุนํ"]],                    //4
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]], //5
            [["ุโน", "ุสฺส"], ["ูนํ" ,"ุนํ"]],                    //6
            [["ุมฺหิ", "ุสฺมึ"], ["ูสุ","ุสุ"]],                     //7
            ["โภ", "ภวนฺโต"]                          //8
        ],


        [
            ["ุ", ["ู","เว","โว"]],                                  //0 ชนฺตุ
            ["ุ", ["ู","โว","ุโน","ุโย"]],                          //1
            ["ุํ", ["ู","โว","ุโน","ุโย"]],                          //2
            ["ุนา", ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]],                 //3
            [["ุโน", "ุสฺส"], ["ูนํ" ,"ุนํ"]],                    //4
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]], //5
            [["ุโน", "ุสฺส"], ["ูนํ" ,"ุนํ"]],                    //6
            [["ุมฺหิ", "ุสฺมึ"], ["ูสุ","ุสุ"]],                     //7
            ["โภ", "ภวนฺโต"]                         //8
        ],

        [   //สตฺถุ
            [["", "า"], "าโร"],
            ["า", "าโร"],
            ["ารํ", ["าเร", "าโร"]],
            [["ารา","ุนา"], ["าเรหิ", "าเรภิ"]],
            [["ุ","ุโน", "ุสฺส"], ["ารานํ", "านํ"]],
            ["ารา", ["าเรหิ", "าเรภิ"]],
            [["ุ","ุโน", "ุสฺส"], ["ารานํ", "านํ"]],
            ["ริ", "าเรสุ"],
            ["โภ", "ภวนฺโต"]
        ],

        [   //กตฺตุ
            [["", "า"], "าโร"],
            ["า", "าโร"],
            ["ารํ", ["าเร", "าโร"]],
            ["ารา", ["าเรหิ", "าเรภิ"]],
            [["ุ","ุโน", "ุสฺส"], ["ารานํ", "านํ", "ูนํ", "ุนํ"]],
            ["ารา", ["าเรหิ", "าเรภิ"]],
            [["ุ","ุโน", "ุสฺส"], ["ารานํ", "านํ", "ูนํ", "ุนํ"]],
            ["ริ", ["าเรสุ","ูสุ","ุสุ"]],
            ["โภ", "ภวนฺโต"]
        ],

        [   //สกมนฺธาตุ
            [["", "า"], "าโร"],
            ["า", "าโร"],
            ["ารํ", ["าเร", "าโร"]],
            ["ารา", ["าเรหิ", "าเรภิ"]],
            ["ุ", ["ารานํ", "านํ", "ูนํ", "ุนํ"]],
            ["ารา", ["าเรหิ", "าเรภิ"]],
            ["ุ", ["ารานํ", "านํ", "ูนํ", "ุนํ"]],
            ["ริ", ["าเรสุ","ูสุ","ุสุ"]],
            ["โภ", "ภวนฺโต"]
        ],

        [   //ปิตุ
            [["", "า"], "โร"],
            ["า", "โร"],
            ["รํ", ["เร", "โร"]],
            [["รา","ุนา"], ["เรหิ", "เรภิ", "ูหิ", "ูภิ", "ุหิ", "ุภิ"]],
            [["ุ","ุโน", "ุสฺส"], ["รานํ", "านํ", "ูนํ", "ุนํ"]],
            ["รา", ["เรหิ", "เรภิ", "ูหิ", "ูภิ", "ุหิ", "ุภิ"]],
            [["ุ","ุโน", "ุสฺส"], ["รานํ", "านํ", "ูนํ", "ุนํ"]],
            ["ริ", ["เรสุ","ูสุ","ุสุ"]],
            ["โภ", "ภวนฺโต"]
        ],

        [   //อภิภู
            ["ุ", ["ู","ุโว"]],
            ["ู", ["ู","ุโว"]],
            ["ุํ", ["ู","ุโว"]],
            ["ุนา", ["ูหิ", "ูภิ"]],
            [["ุโน", "ุสฺส"], "ูนํ"],
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ"]],
            [["ุโน", "ุสฺส"], "ูนํ"],
            [["ุมฺหิ" , "ุสฺมึ"], "ูสุ"],
            ["โภ", "ภวนฺโต"]
        ],

        [   //สหภู
            ["ุ", ["ู","ุโว","ุโน"]],
            ["ู", ["ู","ุโว","ุโน"]],
            ["ุํ",  ["ู","ุโว","ุโน"]],
            ["ุนา", ["ูหิ", "ูภิ"]],
            [["ุโน", "ุสฺส"], "ูนํ"],
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ"]],
            [["ุโน", "ุสฺส"], "ูนํ"],
            [["ุมฺหิ" , "ุสฺมึ"], "ูสุ"],
            ["โภ", "ภวนฺโต"]
        ],

        [   //สพฺพญฺญู
            ["ุ", ["ู","ุโน"]],
            ["ู", ["ู","ุโน"]],
            ["ุํ",  ["ู","ุโน"]],
            ["ุนา", ["ูหิ", "ูภิ"]],
            [["ุโน", "ุสฺส"], "ูนํ"],
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ"]],
            [["ุโน", "ุสฺส"], "ูนํ"],
            [["ุมฺหิ" , "ุสฺมึ"], "ูสุ"],
            ["โภ", "โภนฺโต"]
        ],


        [
            ["โค", ["คาโว","คโว"]],
            ["โค", ["คาโว","คโว"]],
            [["คาวุํ","คาวํ","ควํ"],  ["คาโว","คโว"]],
            [["คาเวน","คเวน"], ["โคหิ", "โคภิ"]],
            [["คาวสฺส", "ควสฺส"], ["ควํ","คุนฺนํ","โคนํ"]],
            [["คาวา", "คาวมฺหา", "คาวสฺมา", "ควา","ควมฺหา","ควสฺมา"], ["โคหิ", "โคภิ"]],
            [["คาวสฺส", "ควสฺส"], ["ควํ","คุนฺนํ","โคนํ"]],
            [["คาเว", "คาวมฺหิ" , "คาวสฺมึ", "คเว", "ควมฺหิ" , "ควสฺมึ"], ["คาเวสุ", "คเวสุ", "โคสุ"]],
            ["เห", "เห"]
        ],

        [   //กญฺญา
            ["-เ", ["า","าโย"]],
            ["า", ["า","าโย"]],
            ["ํ", ["า","าโย"]],
            ["าย", ["าหิ","าภิ"]],
            ["าย", "านํ"],
            ["าย", ["าหิ","าภิ"]],
            ["าย", "านํ"],
            [["าย","ายํ"], "าสุ"],
            ["โภติ", "โภติโย"]
        ],

        [   //อมฺมา
            [["","า"], ["า","าโย"]],
            ["า", ["า","าโย"]],
            ["ํ", ["า","าโย"]],
            ["าย", ["าหิ","าภิ"]],
            ["าย", "านํ"],
            ["าย", ["าหิ","าภิ"]],
            ["าย", "านํ"],
            [["าย","ายํ"], "าสุ"],
            ["โภติ", "โภติโย"]
        ],


        [
            ["รตฺติ", ["รตฺตี", "รตฺติโย"]],
            ["รตฺติ", ["รตฺตี", "รตฺติโย", "รโตฺย"]],
            ["รตฺตึ", ["รตฺตี", "รตฺติโย"]],
            ["รตฺติยา", ["รตฺตีหิ", "รตฺตีภิ","รตฺติหิ", "รตฺติภิ"]],
            ["รตฺติยา", ["รตฺตีนํ" , "รตฺตินํ"]],
            [["รตฺติยา", "รตฺยา"], ["รตฺตีหิ", "รตฺตีภิ","รตฺติหิ", "รตฺติภิ"]],
            ["รตฺติยา", ["รตฺตีนํ" , "รตฺตินํ"]],
            [["รตฺติยา", "รตฺยา", "รตฺยํ", "รตฺตึ", "รตฺโต", "รตฺติยํ"], ["รตฺตีสุ","รตฺติสุ"]],
            ["เห", "เห"]
        ],

        [   //รตฺติ
            ["ิ", ["ี", "ิโย"]],
            ["ิ", ["ี", "ิโย"]],
            ["ึ", ["ี", "ิโย"]],
            ["ิยา", ["ีหิ", "ีภิ","ิหิ", "ิภิ"]],
            ["ิยา", ["ีนํ" , "ินํ"]],
            ["ิยา", ["ีหิ", "ีภิ","ิหิ", "ิภิ"]],
            ["ิยา", ["ีนํ" , "ินํ"]],
            [["ิยา", "ิยํ"], ["ีสุ","ิสุ"]],
            ["เห", "เห"]
        ],

        [   //อิตฺถี
            ["ิ", ["ี", "ิโย"]],
            ["ี", ["ี", "ิโย"]],
            [["ิยํ", "ึ"], ["ี", "ิโย"]],
            ["ิยา", ["ีหิ", "ีภิ"]],
            ["ิยา", "ีนํ" ],
            ["ิยา", ["ีหิ", "ีภิ"]],
            ["ิยา", "ีนํ" ],
            [["ิยา", "ิยํ"], "ีสุ"],
            ["โภติ", "โภติโย"]
        ],

        [   //นที
            ["นทิ", ["นที", "นชฺโช", "นทิโย"]],
            ["นที", ["นที", "นชฺโช", "นทิโย"]],
            [["นทิยํ", "นทึ"], ["นที", "นชฺโช", "นทิโย"]],
            [["นชฺชา", "นทิยา"], ["นทีหิ", "นทีภิ"]],
            [["นชฺชา", "นทิยา"], "นทีนํ" ],
            [["นชฺชา", "นทิยา"], ["นทีหิ", "นทีภิ"]],
            [["นชฺชา", "นทิยา"], "นทีนํ" ],
            [["นชฺชํ", "นทิยํ", "นทิยา"], "นทีสุ"],
            ["โภติ", "โภติโย"]
        ],

        [   //ปุถวี
            ["ปุถวิ", ["ปุถวี", "ปุถวิโย"]],
            ["ปุถวี", ["ปุถวี", "ปุถวิโย"]],
            [["ปุถวิยํ", "ปุถวึ"], ["ปุถวี", "ปุถวิโย"]],
            ["ปุถวิยา", ["ปุถวีหิ", "ปุถวีภิ"]],
            [["ปุถพฺยา","ปุถวิยา"], "ปุถวีนํ" ],
            [["ปุถพฺยา","ปุถวิยา"],  ["ปุถวีหิ", "ปุถวีภิ"]],
            [["ปุถพฺยา","ปุถวิยา"], "ปุถวีนํ" ],
            [["ปุถพฺยํ", "ปุถวิยํ", "ปุถวิยา"], "ปุถวีสุ" ],
            ["โภติ", "โภติโย"]
        ],


        [   //โปกฺขรณี
            ["โปกฺขรณิ", ["โปกฺขรณี", "โปกฺขรญฺโญ", "โปกฺขรณิโย"]],
            ["โปกฺขรณี", ["โปกฺขรณี", "โปกฺขรญฺโญ", "โปกฺขรณิโย"]],
            [["โปกฺขรณิยํ", "โปกฺขรณึ"], ["โปกฺขรณี", "โปกฺขรญฺโญ", "โปกฺขรณิโย"]],
            [["โปกฺขรญฺญา","โปกฺขรณิยา"], ["โปกฺขรณีหิ", "โปกฺขรณีภิ"]],
            [["โปกฺขรญฺญา","โปกฺขรณิยา"], "โปกฺขรณีนํ" ],
            [["โปกฺขรญฺญา","โปกฺขรณิยา"], ["โปกฺขรณีหิ", "โปกฺขรณีภิ"]],
            [["โปกฺขรญฺญา","โปกฺขรณิยา"], "โปกฺขรณีนํ" ],
            [["โปกฺขรญฺญํ", "โปกฺขรณิยํ", "โปกฺขรณิยา"], "โปกฺขรณีสุ" ],
            ["โภติ", "โภติโย"]
        ],

        [   //ยาคุ
            ["ุ", ["ู","ุโย"]],
            ["ุ", ["ู","ุโย"]],                              //1
            ["ุํ", ["ู","ุโย"]],                               //2
            ["ุยา", ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]],
            ["ุยา", ["ูนํ" ,"ุนํ"]],
            ["ุยา", ["ูหิ", "ูภิ", "ุหิ", "ุภิ" ]],
            ["ุยา", ["ูนํ" ,"ุนํ"]],
            [["ุยา", "ุยํ"], ["ูสุ","ุสุ"]],                     //7
            ["เห", "เห"]                          //8
        ],

            /*[   //มาตุ
            [["มาต", "มาตา"], "มาตโร"],
            ["มาตา", "มาตโร"],
            ["มาตรํ", ["มาตเร", "มาตโร"]],
            [["มาตรา","มาตุยา","มตฺยา"], ["มาตเรหิ", "มาตเรภิ", "มาตูหิ", "มาตูภิ", "มาตุหิ", "มาตุภิ"]],
            [["มาตุ", "มาตุสฺส", "มาตุยา"], ["มาตรานํ", "มาตานํ", "มาตูนํ", "มาตุนํ"]],
            [["มาตรา","มาตุยา" ], ["มาตเรหิ", "มาตเรภิ", "มาตูหิ", "มาตูภิ", "มาตุหิ", "มาตุภิ"]],
            [["มาตุ", "มาตุสฺส", "มาตุยา"], ["มาตรานํ", "มาตานํ", "มาตูนํ", "มาตุนํ"]],
            ["มาตริ", ["มาตเรสุ","มาตูสุ", "มาตุสุ"]],
            ["โภติ", "โภติโย"]
        ],*/

        [   //มาตุ
            [["", "า"], "โร"],
            ["า", "โร"],
            ["รํ", ["เร", "โร"]],
            [["รา","ุยา","ฺยา"], ["เรหิ", "เรภิ", "ูหิ", "ูภิ", "ุหิ", "ุภิ"]],
            [["ุ", "ุสฺส", "ุยา"], ["รานํ", "านํ", "ูนํ", "ุนํ"]],
            [["รา","ุยา" ], ["เรหิ", "เรภิ", "ูหิ", "ูภิ", "ุหิ", "ุภิ"]],
            [["ุ", "ุสฺส", "ุยา"], ["รานํ", "านํ", "ูนํ", "ุนํ"]],
            ["ริ", ["เรสุ","ูสุ", "ุสุ"]],
            ["โภติ", "โภติโย"]
        ],

        [   //ชมฺพู
            ["ุ", ["ู","ุโย"]],
            ["ู", ["ู","ุโย"]],                              //1
            ["ุํ", ["ู","ุโย"]],                               //2
            ["ุยา", ["ูหิ", "ูภิ"]],
            ["ุยา", "ูนํ" ],
            ["ุยา", ["ูหิ", "ูภิ"]],
            ["ุยา", "ูนํ" ],
            [["ุยา", "ุยํ"], "ูสุ"],                     //7
            ["เห", "เห"]                          //8
        ],

        [   //จิตฺต
            ["", ["า","านิ"]],
            ["ํ", ["า","านิ"]],
            ["ํ", ["-เ","านิ"]],
            ["-เน", ["-เหิ", "-เภิ"]],
            ["สฺส", "านํ"],
            [["า", "มฺหา", "สฺมา"], ["-เหิ", "-เภิ"]],
            ["สฺส", "านํ"],
            [["-เ", "มฺหิ", "สฺมึ"], "-เสุ"],
            ["เห", "เห"]
        ],

        [   //กมฺม
            ["", ["า","านิ"]],
            ["ํ", ["า","านิ"]],
            ["ํ", ["-เ","านิ"]],
            [["ุนา", "นา", "-เน"], ["-เหิ", "-เภิ"]],
            [["ุโน", "สฺส"], "านํ"],
            [["ุนา", "า", "มฺหา", "สฺมา"], ["-เหิ", "-เภิ"]],
            [["ุโน", "สฺส"], "านํ"],
            [["นิ", "-เ", "มฺหิ", "สฺมึ"], "-เสุ"],
            ["เห", "เห"]
        ],

        [   //ถาม
            ["", ["า","านิ"]],
            ["ํ", ["า","านิ"]],
            ["ํ", ["-เ","านิ"]],
            [["สา", "ุนา", "-เน"], ["-เหิ", "-เภิ"]],
            [["โส", "ุโน", "สฺส"], "านํ"],
            [["ุนา", "า", "มฺหา", "สฺมา"], ["-เหิ", "-เภิ"]],
            [["โส", "ุโน", "สฺส"], "านํ"],
            [["สิ", "นิ", "-เ", "มฺหิ", "สฺมึ"], "-เสุ"],
            ["เห", "เห"]
        ],
        [   //อทฺธ
            ["", ["า","าโน"]],
            ["า", ["า","าโน"]],
            ["านํ", ["าเน","าโน"]],
            ["ุนา", ["าเนหิ", "่าเนภิ"]],
            ["ุโน", "านํ"],
            ["ุนา", ["าเนหิ", "่าเนภิ"]],
            ["ุโน", "านํ"],
            [["นิ", "าเน"], "าเนสุ"],
            ["เห", "เห"]
        ],



        [   //คุณวนฺตุ
            [["ํ","","า"], ["นฺติ","นฺตานิ"]],
            ["ํ", ["นฺติ","นฺตานิ"]],
            ["นฺตํ", ["นฺเต","นฺตานิ"]],
            [["ตา", "นฺเตน"], ["นฺเตหิ", "นฺเตภิ"]],
            [["โต", "นฺตสฺส"], ["ตํ","นฺตานํ"]],
            [["ตา", "นฺตา", "นฺตมฺหา", "นฺตสฺมา"], ["นฺเตหิ", "นฺเตภิ"]],
            [["โต", "นฺตสฺส"], ["ตํ","นฺตานํ"]],
            [["ติ", "นฺเต", "นฺตมฺหิ", "นฺตสฺมึ"], "นฺเตสุ"],
            ["โภ", "ภวนฺโต"]
        ],

        [   //คจฺฉนฺต
            ["นฺต", ["นฺตา","นฺตานิ"]],
            [["ํ", "นฺตํ"], ["นฺตา","นฺตานิ"]],
            ["นฺตํ", ["นฺเต","นฺตานิ"]],
            [["ตา", "นฺเตน"], ["นฺเตหิ", "นฺเตภิ"]],
            [["โต", "นฺตสฺส"], ["ตํ","นฺตานํ"]],
            [["ตา", "นฺตา", "นฺตมฺหา", "นฺตสฺมา"], ["นฺเตหิ", "นฺเตภิ"]],
            [["โต", "นฺตสฺส"], ["ตํ","นฺตานํ"]],
            [["ติ", "นฺเต", "นฺตมฺหิ", "นฺตสฺมึ"], "นฺเตสุ"],
            ["โภ", "ภวนฺโต"]
        ],

        [   //อสฺสทฺธา
            [[""], ["า","านิ"]],
            ["ํ", ["า","านิ"]],
            ["ํ", ["-เ","านิ"]],
            ["-เน", ["-เหิ", "-เภิ"]],
            ["สฺส", "านํ"],
            [["า", "มฺหา", "สฺมา"], ["-เหิ", "-เภิ"]],
            ["สฺส", "านํ"],
            [["-เ", "มฺหิ", "สฺมึ"], "-เสุ"],
            ["เห", "เห"]
        ],

        [   //มุขนาสิกา
            ["","X"],
            ["ํ","X"],
            ["ํ","X"],
            ["-เน","X"],
            ["สฺส","X"],
            [["า", "มฺหา", "สฺมา"],"X"],
            ["สฺส","X"],
            [["-เ", "มฺหิ", "สฺมึ"],"X"],
            ["เห", "เห"]
        ],

        [   //อฏฺฐิ
            ["ิ", ["ี", "ีนิ"]],
            ["ิ", ["ี", "ีนิ"]],
            ["ึ", ["ี", "ีนิ"]],
            ["ินา", ["ีหิ", "ีภิ","ิหิ", "ิภิ"]],
            [["ิโน", "ิสฺส"], ["ีนํ" , "ินํ"]],
            [["ินา", "ิมฺหา", "ิสฺมา"], ["ีหิ", "ีภิ","ิหิ", "ิภิ"]],
            [["ิโน", "ิสฺส"], ["ีนํ" , "ินํ"]],
            [["ิมฺหิ", "ิสฺมึ"], ["ีสุ","ิสุ"]],
            ["เห", "เห"]
        ],

        [   //สุขการี
            ["ิ", ["ี", "ีนิ"]],
            ["ิ", ["ี", "ีนิ"]],
            [["ินํ", "ึ"], ["ี" , "ีนิ"]],
            ["ินา", ["ีหิ", "ีภิ"]],
            [["ิโน", "ิสฺส"], ["ีนํ" ]],
            [["ินา", "ิมฺหา", "ิสฺมา"], ["ีหิ", "ีภิ"]],
            [["ิโน", "ิสฺส"], "ีนํ" ],
            [["ินิ", "ิมฺหิ", "ิสฺมึ"], "ีสุ"],
            ["เห", "เห"]
        ],



        [   //อายุ
            ["ุ", ["ู", "ูนิ"]],
            ["ุ", ["ู", "ูนิ"]],
            ["ุํ" ,   ["ู" , "ูนิ"]],
            [["ุสา", "ุนา"], ["ูหิ", "ูภิ", "ุหิ", "ุภิ"]],
            [["ุโน", "ุสฺส"], ["ูนํ" , "ุนํ"]],
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ", "ุหิ", "ุภิ"]],
            [["ุโน", "ุสฺส"], ["ูนํ" , "ุนํ"]],
            [["ุมฺหิ", "ุสฺมึ" ],  ["ูสุ", "ุสุ"]],
            ["เห", "เห"]
        ],

        [   //โคตฺรภู
            ["ุ", ["ู", "ูนิ"]],
            ["ุ", ["ู", "ูนิ"]],
            ["ุํ" ,   ["ู" , "ูนิ"]],
            ["ุนา", ["ูหิ", "ูภิ"]],
            [["ุโน", "ุสฺส"], "ูนํ" ],
            [["ุนา", "ุมฺหา", "ุสฺมา"], ["ูหิ", "ูภิ"]],
            [["ุโน", "ุสฺส"], "ูนํ" ],
            [["ุมฺหิ", "ุสฺมึ" ], "ูสุ"],
            ["เห", "เห"]
        ],

        [   //จิตฺตโค
            ["คุ", ["คู", "คูนิ"]],
            ["คุ", ["คู", "คูนิ"]],
            ["คุํ" ,   ["คู" , "คูนิ"]],
            ["คุนา", ["คูหิ", "คูภิ", "คุหิ", "คุภิ"]],
            [["คุโน", "คุสฺส"], ["คูนํ" , "คุนํ"]],
            [["คุนา", "คุมฺหา", "คุสฺมา"], ["คูหิ", "คูภิ", "คุหิ", "คุภิ"]],
            [["คุโน", "คุสฺส"], ["คูนํ" , "คุนํ"]],
            [["คุมฺหิ", "คุสฺมึ" ], ["คูสุ", "คุสุ"]],
            ["เห", "เห"]
        ],


        [   //สพฺพ (ปุง)
            [["", "า"], "-เ"],
            ["-โ", "-เ"],
            ["ํ", "-เ"],
            ["-เน",   ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [ ["มฺหา","สฺมา"],  ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [["มฺหิ","สฺมึ"],  "-เสุ"],

            ["", ""]
        ],

        [   //สพฺพ (อิตฺ) ปุพฺพ (อิตฺ)
            ["-เ", ["า", "าโย"]],
            ["า", ["า", "าโย"]],
            ["ํ", ["า", "าโย"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], ["าสํ", "าสานํ"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], ["าสํ", "าสานํ"]],
            [["สฺสํ","ายํ"],  "าสุ"],

            ["", ""]
        ],

        [   //สพฺพ (นปุง)
            ["", "านิ"],
            ["ํ", "านิ"],
            ["ํ", "านิ"],
            ["-เน",   ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [ ["มฺหา","สฺมา"],  ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [["มฺหิ","สฺมึ"],  "-เสุ"],

            ["", ""]
        ],

        [   // กตรกตม (ปุง)
            ["X", ["-เ", "า"]],
            ["X", ["-เ", "า"]],
            ["X", "-เ"],
            ["X",   ["-เหิ" , "-เภิ"]],
            ["X", "านํ"],
            ["X",   ["-เหิ" , "-เภิ"]],
            ["X", "านํ"],
            ["X",  "-เสุ"],

            ["", ""]

        ],

        [   // กตรกตม (อิ)
            ["X", ["า", "าโย"]],
            ["X", ["า", "าโย"]],
            ["X", ["า", "าโย"]],
            ["X",   ["าหิ" , "าภิ"]],
            ["X", "านํ"],
            ["X",   ["าหิ" , "าภิ"]],
            ["X", "านํ"],
            ["X",  "าสุ"],

            ["", ""]

        ],

        [   // กตรกตม (นปุง)
            ["X", "านิ"],
            ["X", "านิ"],
            ["X", "านิ"],
            ["X",   ["-เหิ" , "-เภิ"]],
            ["X", "านํ"],
            ["X",   ["-เหิ" , "-เภิ"]],
            ["X", "านํ"],
            ["X",  "-เสุ"],

            ["", ""]

        ],



        [   //ปุพฺพ (ปุง)
            ["", ["-เ", "า"]],
            ["-โ", ["-เ", "า"]],
            ["ํ", "-เ"],
            ["-เน",   ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [ ["า", "มฺหา","สฺมา"],  ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [["-เ", "มฺหิ","สฺมึ"],  "-เสุ"],

            ["", ""]
        ],


        [   //สพฺพ (อิตฺ) ปุพฺพ (อิตฺ)
            ["-เ", ["า", "าโย"]],
            ["า", ["า", "าโย"]],
            ["ํ", ["า", "าโย"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], ["าสํ", "าสานํ"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], ["าสํ", "าสานํ"]],
            [["สฺสํ","ายํ"],  "าสุ"],

            ["", ""]
        ],

        [   //ปุพฺพ (นปุง)
            ["", "านิ"],
            ["ํ", "านิ"],
            ["ํ", "านิ"],
            ["-เน",   ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [ ["า", "มฺหา","สฺมา"],  ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [["-เ", "มฺหิ","สฺมึ"],  "-เสุ"],

            ["", ""]
        ],

        [   //ทกฺขิณปุพฺพ (อิตฺ)
            ["-เ", ["า", "าโย"]],
            ["า", ["า", "าโย"]],
            ["ํ", ["า", "าโย"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], "านํ"],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], "านํ"],
            [["สฺสํ","าย","ายํ"],  "าสุ"],

            ["", ""]
        ],


        [   //ย (ปุง)
            [[], []],
            ["-โ", "-เ"],
            ["ํ", "-เ"],
            ["-เน",   ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [ ["มฺหา","สฺมา"],  ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [["มฺหิ","สฺมึ"],  "-เสุ"],

            ["", ""]
        ],

        [   //ย (อิตฺ)
            [[], []],
            ["า", ["า", "าโย"]],
            ["ํ", ["า", "าโย"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], ["าสํ", "าสานํ"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], ["าสํ", "าสานํ"]],
            [["สฺสํ","ายํ"],  "าสุ"],

            ["", ""]
        ],

        [   //ย (นปุง)
            [[], []],
            ["ํ", "านิ"],
            ["ํ", "านิ"],
            ["-เน",   ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [ ["มฺหา","สฺมา"],  ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [["มฺหิ","สฺมึ"],  "-เสุ"],

            ["", ""]
        ],

        [   //ต (ปุง)
            [[], []],
            ["โส", ["เน", "เต"]],
            [["นํ", "ตํ"], ["เน", "เต"]],
            [["เนน","เตน"],   ["เนหิ","เนภิ","เตหิ","เตภิ"]],
            [["อสฺส","นสฺส","ตสฺส"], ["เนสํ","เนสานํ","เตสํ","เตสานํ"]],
            [ ["อสฺมา","นสฺมฺา","ตสฺมา","นมฺหา","ตมฺหา"],  ["เนหิ","เนภิ","เตหิ","เตภิ"]],
            [["อสฺส","นสฺส","ตสฺส"], ["เนสํ","เนสานํ","เตสํ","เตสานํ"]],
            [["อสฺมึ","นสฺมึ","ตสฺมึ","นมฺหิ","ตมฺหิ"],  ["เนสุ","เตสุ"]],

            ["", ""]
        ],

        [   //ต (อิ)
            [[], []],
            ["สา", ["นา", "ตา", "นาโย", "ตาโย"]],
            [["นํ", "ตํ"], ["นา", "ตา", "นาโย", "ตาโย"]],
            [["นาย","ตาย"],   ["นาหิ","นาภิ","ตาหิ","ตาภิ"]],
            [["ติสฺสาย","ตสฺสาย","อสฺสาย","นสฺสาย","ติสฺสา","ตสฺสา","อสฺสา","นสฺสา"], ["นาสํ","นาสานํ","ตาสํ","ตาสานํ"]],
            [["นาย","ตาย"],   ["นาหิ","นาภิ","ตาหิ","ตาภิ"]],
            [["ติสฺสาย","ตสฺสาย","อสฺสาย","นสฺสาย","ติสฺสา","ตสฺสา","อสฺสา","นสฺสา"], ["นาสํ","นาสานํ","ตาสํ","ตาสานํ"]],
            [["ติสฺสํ","ตสฺสํ","อสฺสํ","นสฺสํ","นายํ","ตายํ"],  ["นาสุ","ตาสุ"]],

            ["", ""]
        ],

        [   //ต (นปุง)
            [[], []],
            [["นํ", "ตํ"], ["นานิ", "ตานิ"]],
            [["นํ", "ตํ"], ["นานิ", "ตานิ"]],
            [["เนน","เตน"],   ["เนหิ","เนภิ","เตหิ","เตภิ"]],
            [["อสฺส","นสฺส","ตสฺส"], ["เนสํ","เนสานํ","เตสํ","เตสานํ"]],
            [ ["อสฺมา","นสฺมฺา","ตสฺมา","นมฺหา","ตมฺหา"],  ["เนหิ","เนภิ","เตหิ","เตภิ"]],
            [["อสฺส","นสฺส","ตสฺส"], ["เนสํ","เนสานํ","เตสํ","เตสานํ"]],
            [["อสฺมึ","นสฺมึ","ตสฺมึ","นมฺหิ","ตมฺหิ"],  ["เนสุ","เตสุ"]],

            ["", ""]
        ],

        [   //เอต (ปุง)
            [[], []],
            ["โส", "เต"],
            ["ตํ", "เต"],
            ["เตน", ["เตหิ" , "เตภิ"]],
            ["ตสฺส", ["เตสํ", "เตสานํ"]],
            [ ["ตมฺหา","ตสฺมา"],  ["เตหิ" , "เตภิ"]],
            ["ตสฺส", ["เตสํ", "เตสานํ"]],
            [["ตมฺหิ","ตสฺมึ"],  "เตสุ"],
            ["", ""]
        ],

        [   //เอตา (อิตฺ)
            [[], []],
            ["สา", ["ตา", "ตาโย"]],
            ["ตํ", ["ตา", "ตาโย"]],
            ["ตาย", ["ตาหิ" , "ตาภิ"]],
            [["ติสฺสาย","ติสฺสา","ตาย"], ["ตาสํ", "ตาสานํ"]],
            ["ตาย", ["ตาหิ" , "ตาภิ"]],
            [["ติสฺสาย","ติสฺสา","ตาย"], ["ตาสํ", "ตาสานํ"]],
            [["ติสฺสํ","ตายํ"],  "ตาสุ"],
            ["", ""]
        ],

        [   //เอต (นปุง)
            [[], []],
            ["ตํ", "ตานิ"],
            ["ตํ", "ตานิ"],
            ["เตน", ["เตหิ" , "เตภิ"]],
            ["ตสฺส", ["เตสํ", "เตสานํ"]],
            [ ["ตมฺหา","ตสฺมา"],  ["เตหิ" , "เตภิ"]],
            ["ตสฺส", ["เตสํ", "เตสานํ"]],
            [["ตมฺหิ","ตสฺมึ"],  "เตสุ"],
            ["", ""]
        ],

        [   //อญฺญา (อิตฺ)
            [[], []],
            ["า", ["า", "าโย"]],
            ["-เ", ["า", "าโย"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["ิสฺสา","าย"], ["าสํ", "าสานํ"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["ิสฺสา","าย"], ["าสํ", "าสานํ"]],
            [["ิสฺสํ","ายํ"],  "าสุ"],

            ["", ""]
        ],

        [   //อิม (ปุง)
            [[], []],
            ["อยํ", "อิเม"],
            ["อิมํ", "อิเม"],
            [["อเนน", "อิมินา"],   ["เอหิ","เอภิ", "อิเมหิ","อิเมภิ"]],
            [["อสฺส", "อิมสฺส"], ["เอสํ","เอสานํ","อิเมสํ","อิเมสานํ"]],
            [["อสฺมา", "อิมสฺมา", "อิมมฺหา"],   ["เอหิ","เอภิ", "อิเมหิ","อิเมภิ"]],
            [["อสฺส", "อิมสฺส"], ["เอสํ","เอสานํ","อิเมสํ","อิเมสานํ"]],
            [["อสฺมึ", "อิมสฺมึ", "อิมมฺหิ"], ["เอสุ","อิเมสุ"]],

            ["", ""]
        ],

        [   //อิมา (อิต)
            [[], []],
            ["อยํ", ["อิมา","อิมาโย"]],
            ["อิมํ", ["อิมา","อิมาโย"]],
            ["อิมาย", ["อิมาหิ","อิมาภิ"]],
            [["อสฺสาย", "อิมิสฺสาย", "อสฺสา", "อิมิสฺสา", "อิมาย"], ["อิมาสํ","อิมาสานํ"]],
            ["อิมาย",  ["อิมาหิ","อิมาภิ"]],
            [["อสฺสาย", "อิมิสฺสาย", "อสฺสา", "อิมิสฺสา", "อิมาย"], ["อิมาสํ","อิมาสานํ"]],
            [["อสฺสํ", "อิมิสฺสํ", "อิมิสฺสา", "อิมายํ"], "อิมาสุ"],

            ["", ""]
        ],

        [   //อิม (นปุง)
            [[], []],
            [["อิทํ","อิมํ"], "อิมานิ"],
            [["อิทํ","อิมํ"], "อิมานิ"],
            [["อเนน", "อิมินา"],   ["เอหิ","เอภิ", "อิเมหิ","อิเมภิ"]],
            [["อสฺส", "อิมสฺส"], ["เอสํ","เอสานํ","อิเมสํ","อิเมสานํ"]],
            [["อสฺมา", "อิมสฺมา", "อิมมฺหา"],   ["เอหิ","เอภิ", "อิเมหิ","อิเมภิ"]],
            [["อสฺส", "อิมสฺส"], ["เอสํ","เอสานํ","อิเมสํ","อิเมสานํ"]],
            [["อสฺมึ", "อิมสฺมึ", "อิมมฺหิ"], ["เอสุ","อิเมสุ"]],

            ["", ""]
        ],

        [   //อมุ (ปุ)
            [[], []],
            ["อสุ", "อมู"],
            ["อมุํ", "อมู"],
            ["อมุนา", ["อมูหิ","อมูภิ","อมุหิ","อมุภิ"]],
            [["อทุสฺส", "อมุสฺส"], ["อมูสํ","อมูสานํ","อมุสํ","อมุสานํ"]],
            [["อมุมฺหา","อมุสฺมา"], ["อมูหิ","อมูภิ","อมุหิ","อมุภิ"]],
            [["อทุสฺส", "อมุสฺส"], ["อมูสํ","อมูสานํ","อมุสํ","อมุสานํ"]],
            [["อมุมฺหิ", "อมุสฺมึ"], ["อมูสุ","อมุสุ"]],

            ["", ""]
        ],

        [   //อมุ (อิตฺ)
            [[], []],
            ["อสุ", ["อมู","อมุโย"]],
            ["อมุํ", ["อมู","อมุโย"]],
            ["อมุยา", ["อมูหิ","อมูภิ"]],
            [["อมุสฺสา", "อมุยา"], ["อมูสํ","อมูสานํ"]],
            ["อมุยา", ["อมูหิ","อมูภิ"]],
            [["อมุสฺสา", "อมุยา"], ["อมูสํ","อมูสานํ"]],
            [[ "อมุสฺสา", "อมุสฺสํ", "อมุยา", "อมุยํ"], "อมูสุ"],

            ["", ""]
        ],
        [   //อมุ (นปุ)
            [[], []],
            ["อทุํ", ["อมู","อมูนิ"]],
            ["อทุํ", ["อมู","อมูนิ"]],
            ["อมุนา", ["อมูหิ","อมูภิ","อมุหิ","อมุภิ"]],
            [["อทุสฺส", "อมุสฺส"], ["อมูสํ","อมูสานํ","อมุสํ","อมุสานํ"]],
            [["อมุมฺหา","อมุสฺมา"], ["อมูหิ","อมูภิ","อมุหิ","อมุภิ"]],
            [["อทุสฺส", "อมุสฺส"], ["อมูสํ","อมูสานํ","อมุสํ","อมุสานํ"]],
            [["อมุมฺหิ", "อมุสฺมึ"], ["อมูสุ","อมุสุ"]],

            ["", ""]
        ],

        [   //กึ (ปุง)
            [[], []],
            ["-โ", "-เ"],
            ["ํ", "-เ"],
            ["-เน",   ["-เหิ" , "-เภิ"]],
            [["สฺส","ิสฺส"], ["-เสํ", "-เสานํ"]],
            [ ["มฺหา","สฺมา"],  ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [["มฺหิ","สฺมึ","ิมฺหิ","ิสฺมึ"],  "-เสุ"],

            ["", ""]
        ],


        [   //กึ (อิตฺ) เหมือน ย
            [[], []],
            ["า", ["า", "าโย"]],
            ["ํ", ["า", "าโย"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], ["าสํ", "าสานํ"]],
            ["าย",   ["าหิ" , "าภิ"]],
            [["สฺสา","าย"], ["าสํ", "าสานํ"]],
            [["สฺสํ","ายํ"],  "าสุ"],

            ["", ""]
        ],

        [   //กึ (นปุง)
            [[], []],
            ["ึ", "านิ"],
            ["ึ", "านิ"],
            ["-เน",   ["-เหิ" , "-เภิ"]],
            [["สฺส","ิสฺส"], ["-เสํ", "-เสานํ"]],
            [ ["มฺหา","สฺมา"],  ["-เหิ" , "-เภิ"]],
            ["สฺส", ["-เสํ", "-เสานํ"]],
            [["มฺหิ","สฺมึ"],  "-เสุ"],

            ["", ""]
        ],

        [   //โกจิ (ปุง)
            [[], []],
            ["-โจิ", "-เจิ"],
            ["ญฺจิ", "-เจิ"],
            ["-เนจิ", "-เหิจิ"],
            ["สฺสจิ", "-เสญฺจิ"],
            ["สฺมาจิ", "-เหิจิ"],
            ["สฺสจิ", "-เสญฺจิ"],
            [["สฺมิญฺจิ","ิสฺมิญฺจิ"],  "-เสุจิ"],

            ["", ""]
        ],


        [   //กาจิ (อิตฺ)
            [[], []],
            ["าจิ", "าจิ"],
            ["ญฺจิ", "าจิ"],
            ["ายจิ", "าหิจิ"],
            [["สฺสาจิ","ายจิ"], "าสญฺจิ"],
            ["ายจิ", "าหิจิ"],
            [["สฺสาจิ","ายจิ"], "าสญฺจิ"],
            [["าสญฺจิ","ายญฺจิ"],  "าสุจิ"],

            ["", ""]
        ],

        [   //โกจิ (นปุง)
            [[], []],
            ["ิญฺจิ", "านิจิ"],
            ["ิญฺจิ", "านิจิ"],
            ["-เนจิ", "-เหิจิ"],
            ["สฺสจิ", "-เสญฺจิ"],
            ["สฺมาจิ", "-เหิจิ"],
            ["สฺสจิ", "-เสญฺจิ"],
            [["สฺมิญฺจิ","ิสฺมิญฺจิ"],  "-เสุจิ"],

            ["", ""]
        ],


        [   //โย โกจิ (ปุง)
            [[], []],
            ["-โ โกจิ", "-เ เกจิ"],
            ["ญฺจิ", "-เจิ"],
            ["-เน เกนจิ", "-เหิ เกหิจิ"],
            ["สฺส กสฺสจิ", "-เสํ เกสญฺจิ"],
            ["สฺมา กสฺมาจิ", "-เหิ เกหิจิ"],
            ["สฺส กสฺสจิ", "-เสํ เกสญฺจิ"],
            [["สฺมึ กสฺมิญฺจิ","สฺมึ กิสฺมิญฺจิ"],  "-เสุ เกสุจิ"],

            ["", ""]
        ],


        [   //ยา กาจิ (อิตฺ)
            [[], []],
            ["า กาจิ", "า กาจิ"],
            ["ํ กญฺจิ", "า กาจิ"],
            ["าย กายจิ", "าหิ กาหิจิ"],
            [["สฺสา กสฺสาจิ","าย กายจิ"], "าสํ กาสญฺจิ"],
            ["าย กายจิ", "าหิ กาหิจิ"],
            [["สฺสา กสฺสาจิ","าย กายจิ"], "าสํ กาสญฺจิ"],
            [["สฺสํ กาสญฺจิ","ายํ กายญฺจิ"],  "าสุุ กาสุจิ"],

            ["", ""]
        ],

        [   //ยํ กิญฺจิ (นปุง)
            [[], []],

            ["ํ กญฺจิ", "านิ กานิจิ"],
            ["ํ กญฺจิ", "านิ กานิจิ"],
            ["-เน เกนจิ", "-เหิ เกหิจิ"],
            ["สฺส กสฺสจิ", "-เสํ เกสญฺจิ"],
            ["สฺมา กสฺมาจิ", "-เหิ เกหิจิ"],
            ["สฺส กสฺสจิ", "-เสํ เกสญฺจิ"],
            [["สฺมึ กสฺมิญฺจิ","สฺมึ กิสฺมิญฺจิ"],  "-เสุ เกสุจิ"],

            ["", ""]
        ],



        [   //เอก (ปุง)
            [[], []],
            ["-โ", "X"],
            ["ํ", "X"],
            ["-เน",  "X"],
            ["สฺส", "X"],
            [ ["มฺหา","สฺมา"], "X"],
            ["สฺส", "X"],
            [["มฺหิ","สฺมึ"],  "X"],

            ["", ""]
        ],

        [   //เอก (อิตฺ)
            [[], []],
            ["า", "X"],
            ["ํ", "X"],
            ["าย",  "X"],
            [["ิสฺสาย","าย"], "X"],
            ["าย",  "X"],
            [["ิสฺสาย","าย"], "X"],
            [["ิสฺสํ","ายํ"],  "X"],

            ["", ""]
        ],

        [   //เอก (นปุง)
            [[], []],
            ["ํ", "X"],
            ["ํ", "X"],
            ["-เน",  "X"],
            ["สฺส", "X"],
            [ ["มฺหา","สฺมา"], "X"],
            ["สฺส", "X"],
            [["มฺหิ","สฺมึ"],  "X"],

            ["", ""]
        ],

        [   //อุภ
            [[], []],
            ["X", ["-โ", "-เ"]],
            ["X", ["-โ", "-เ"]],
            ["X",  ["-โหิ" , "-โภิ", "-เหิ" , "-เภิ"]],
            ["X", "ินฺนํ"],
            ["X",  ["-โหิ" , "-โภิ", "-เหิ" , "-เภิ"]],
            ["X", "ินฺนํ"],
            ["X", ["-โสุ", "-เสุ"]],

            ["", ""]
        ],

        [   //เทฺว
            [[], []],
            ["X", ["เทฺว", "ทุเว"]],
            ["X", ["เทฺว", "ทุเว"]],
            ["X", ["ทฺวีหิ" , "ทฺวีภิ"]],
            ["X", ["ทฺวินฺนํ", "ทุวินฺนํ"]],
            ["X", ["ทฺวีหิ" , "ทฺวีภิ"]],
            ["X", ["ทฺวินฺนํ", "ทุวินฺนํ"]],
            ["X", "ทฺวีสุ"],

            ["", ""]
        ],

        [   //ติ (ปุง)
            [[], []],
            ["X", "ตโย"],
            ["X", "ตโย"],
            ["X", ["ตีหิ" , "ตีภิ"]],
            ["X", ["ติณฺณํ", "ติณฺณนฺนํ"]],
            ["X", ["ตีหิ" , "ตีภิ"]],
            ["X", ["ติณฺณํ", "ติณฺณนฺนํ"]],
            ["X", "ตีสุ"],

            ["", ""]
        ],

        [   //ติ (อิต)
            [[], []],
            ["X", "ติสฺโส"],
            ["X", "ติสฺโส"],
            ["X", ["ตีหิ" , "ตีภิ"]],
            ["X", "ติสฺสนฺนํ"],
            ["X", ["ตีหิ" , "ตีภิ"]],
            ["X", "ติสฺสนฺนํ"],
            ["X", "ตีสุ"],

            ["", ""]
        ],

        [   //ติ (นปุง)
            [[], []],
            ["X", "ตีณิ"],
            ["X", "ตีณิ"],
            ["X", ["ตีหิ" , "ตีภิ"]],
            ["X", ["ติณฺณํ", "ติณฺณนฺนํ"]],
            ["X", ["ตีหิ" , "ตีภิ"]],
            ["X", ["ติณฺณํ", "ติณฺณนฺนํ"]],
            ["X", "ตีสุ"],

            ["", ""]
        ],

        [   //จตุ (ปุง)
            [[], []],
            ["X", ["จตฺตาโร","จตุโร"]],
            ["X", ["จตฺตาโร","จตุโร"]],
            ["X", ["จตูหิ","จตูภิ","จตุพฺภิ"]],
            ["X", "จตุนฺนํ"],
            ["X", ["จตูหิ","จตูภิ","จตุพฺภิ"]],
            ["X", "จตุนฺนํ"],
            ["X", "จตูสุ"],

            ["", ""]
        ],

        [   //จตุ (อิตฺ)
            [[], []],
            ["X", "จตสฺโส"],
            ["X", "จตสฺโส"],
            ["X", ["จตูหิ","จตูภิ","จตุพฺภิ"]],
            ["X", "จตสฺสนฺนํ"],
            ["X", ["จตูหิ","จตูภิ","จตุพฺภิ"]],
            ["X", "จตสฺสนฺนํ"],
            ["X", "จตูสุ"],

            ["", ""]
        ],

        [   //จตุ (นปุง)
            [[], []],
            ["X", "จตฺตาริ"],
            ["X", "จตฺตาริ"],
            ["X", ["จตูหิ","จตูภิ","จตุพฺภิ"]],
            ["X", "จตุนฺนํ"],
            ["X", ["จตูหิ","จตูภิ","จตุพฺภิ"]],
            ["X", "จตุนฺนํ"],
            ["X", "จตูสุ"],

            ["", ""]
        ],

        [   //ตุมฺห
            [[], []],
            [["ตฺวํ", "ตุวํ"], ["ตุมฺเห", "โว"]],
            [["ตวํ", "ตํ", "ตฺวํ", "ตุวํ"], ["ตุมฺหากํ", "ตุมฺเห", "โว"]],
            [["ตยา", "ตฺวยา", "เต"],   ["ตุมฺเหหิ" , "ตุมฺเหภิ", "โว"]],
            [["ตุมฺหํ", "ตว", "ตุยฺหํ", "เต"], ["ตุมฺหํ", "ตุมฺหากํ", "โว"]],
            ["ตยา",   ["ตุมฺเหหิ" , "ตุมฺเหภิ"]],
            [["ตุมฺหํ", "ตว", "ตุยฺหํ", "เต"], ["ตุมฺหํ", "ตุมฺหากํ", "โว"]],
            [["ตยิ", "ตฺวยิ"], "ตุมฺเหสุ"],

            ["", ""]
        ],

        [   //อมฺห
            [[], []],
            ["อหํ", ["มยํ", "อมฺเห", "โน"]],
            [["มํ", "มมํ"], ["อมฺหากํ", "อมฺเห", "โน"]],
            [["มยา", "เม"],   ["อมฺเหหิ" , "อมฺเหภิ", "โน"]],
            [["อมฺหํ", "มม", "มยฺหํ", "มมํ", "เม"], ["อมฺหํ", "อมฺหากํ", "อสฺมากํ", "โน"]],
            ["มยา",   ["อมฺเหหิ" , "อมฺเหภิ"]],
            [["อมฺหํ", "มม", "มยฺหํ", "มมํ", "เม"], ["อมฺหํ", "อมฺหากํ", "อสฺมากํ", "โน"]],
            ["มยิ", "อมฺเหสุ"],

            ["", ""]
        ],

        [   //ปญฺจ
            [[], []],
            ["X", ""],
            ["X", ""],
            ["X", ["หิ" , "ภิ"]],
            ["X", "นฺนํ"],
            ["X", ["หิ" , "ภิ"]],
            ["X", "นฺนํ"],
            ["X", "สุ"],

            ["", ""]
        ],

        [   //กติ
            [[], []],
            ["X", "ิ"],
            ["X", "ิ"],
            ["X", ["ิหิ" , "ิภิ"]],
            ["X", "ีนํ"],
            ["X", ["ิหิ" , "ิภิ"]],
            ["X", "ีนํ"],
            ["X", "ิสุ"],

            ["", ""]
        ],

        [   //อุปนตร
            ["ํ", "ํ"],
            ["ํ", "ํ"],
            ["ํ", "ํ"],
            [["ํ","-เน"], ["ํ" , "-เหิ"]],
            ["ํ", "ํ"],
            [["า","มฺหา","สฺมา"], "-เหิ"],
            [["ํ","สฺส"], ["ํ" , "านํ"]],
            [["ํ","มฺหิ","สฺมึ"], ["ํ","-เสุ"]],

            ["", ""]
        ],

        [   //ติโลก
            ["", "X"],
            ["ํ", "X"],
            ["ํ", "X"],
            ["-เน",  "X"],
            ["สฺส", "X"],
            [ ["า","มฺหา","สฺมา"], "X"],
            ["สฺส", "X"],
            [["-เ","มฺหิ","สฺมึ"], "X"],

            ["", ""]
        ],
    ];



    if (mode_ID>9) {
        var totl_vocab_list = [], card_list=[];

        var begin_vocab_index, end_vocab_index, ii;

        if (pattern_ID==-1) {
            begin_vocab_index = 0;
            end_vocab_index = 56; //vocab_list.length; ไม่เอาสัพพนาม

        }
        else if (subpattern_list[pattern_ID][1] == null) {
            begin_vocab_index = subpattern_list[pattern_ID][0];
            end_vocab_index = subpattern_list[pattern_ID][0]+1;
        }

        else {          // Monte Carlos
            begin_vocab_index = subpattern_list[pattern_ID][0];
            end_vocab_index = subpattern_list[pattern_ID][1]+1;
        }


        while(totl_vocab_list.length < MW*MH)

        for (i = begin_vocab_index; i < end_vocab_index; i++) {

                if (!jQuery.isArray(vocab_list[i][0])) {
                    if (pattern_ID == -1)
                        continue;
                    ii = vocab_list[i][0];
                }
                else
                    ii = i;



                for (j = 0; j < vocab_list[ii].length; j++)
                    totl_vocab_list.push([vocab_list[ii][j][0] + vocab_suffix[ii] + "<SPAN class='matching_gender'> (" +

                    GenderFromVocabList (ii, false)

                    + ")</SPAN>", vocab_list[ii][j][1]]);

            }





        //console.log(totl_vocab_list);

        card_pair_left = MW*MH/2;

        for (i=0; i< card_pair_left; i++) {

            j = randomise(0, totl_vocab_list.length-1);


            k=totl_vocab_list[i];
            totl_vocab_list[i]=totl_vocab_list[j];
            totl_vocab_list[j]=k;
        }



        for (i=0; i< card_pair_left; i++) {
            card_list.push([totl_vocab_list[i][0],totl_vocab_list[i][1],true]);
            card_list.push([totl_vocab_list[i][1],totl_vocab_list[i][0],false]);
        }



        for (i=0; i< card_list.length; i++) {
            j = randomise(0, card_list.length-1);

            k=card_list[i];
            card_list[i]=card_list[j];
            card_list[j]=k;
        }

        //console.log(card_list);
        //console.log(card_pair_left);

        for (i=0, k=0; i<MH; i++) {
            for (j = 0; j < MW; j++) {
                $("#card"+i+"_"+j).prop("x", card_list[k][0]);
                $("#card"+i+"_"+j).prop("y", card_list[k][1]);
                $("#card"+i+"_"+j).prop("pali", card_list[k++][2]);
            }
        }


        return;
    }









    if (pattern_ID==-1)
        Xpattern_ID = randomise(0,subpattern_list.length-1);
    else
        Xpattern_ID = pattern_ID;





    //console.log("Xpattern_ID = "+Xpattern_ID);


    if (subpattern_list[Xpattern_ID][1] == null)
        subpattern_ID = subpattern_list[Xpattern_ID][0];

    else {          // Monte Carlos
        for (i = subpattern_list[Xpattern_ID][0], j = 0; i <= subpattern_list[Xpattern_ID][1]; i++)
            j += vocab_list[i].length;

        k = randomise(0, j - 1);
        for (i = subpattern_list[Xpattern_ID][0], j = 0; i <= subpattern_list[Xpattern_ID][1]; i++) {
            j += vocab_list[i].length;
            if (j > k)
                break;
        }
        subpattern_ID = i;
    }



    console.log("pattern_ID = "+pattern_ID+" | subpattern_ID = "+subpattern_ID);
    //console.log(subpattern_list[pattern_ID][0] + " , " + subpattern_list[pattern_ID][1]);

    if (jQuery.isArray(vocab_list[subpattern_ID][0]))
        noun = vocab_list[subpattern_ID][randomise(0, vocab_list[subpattern_ID].length - 1)];
        //gender = GenderFromVocabList(subpattern_ID, true);

    else
        noun = vocab_list[vocab_list[subpattern_ID][0]][randomise(0, vocab_list[vocab_list[subpattern_ID][0]].length - 1)];

    gender = GenderFromVocabList(subpattern_ID, true);

    meaning = noun[1];
    noun = noun[0];


    ans_count = 0;

    for (i = 0; i < 8; i++)
        n_vibhatti_ans_boo[i] = [false, false];

    /*
     if (r_vi == 0) {
     if (Math.random()<0.5)
     r_vi = 8;

     }*/

    //console.log("Dd");

    if (mode_group==2) {
        for (i = 0; i < 8; i++) {

            if (!$("#Key" + i + "0").hasClass("ui-icon-carat-r")) {
                $("#Key" + i + "0").addClass("ui-icon-carat-r ui-alt-icon");
                $("#Key" + i + "0").removeClass("ui-icon-delete ui-icon-check");
                Whiten.push([i, 0]);

                //$("#Key"+i+"0").removeClass("WrongBttn RightBttn ui-icon-delete ui-icon-check");

                //$("#Key"+i+"0").text("เอก");
                //FadeIt("#Key"+i+"0");
            }

            if (!$("#Key" + i + "1").hasClass("ui-icon-carat-r")) {


                $("#Key" + i + "1").addClass("ui-icon-carat-r ui-alt-icon");
                $("#Key" + i + "1").removeClass("ui-icon-delete ui-icon-check");
                Whiten.push([i, 1]);

                //$("#Key"+i+"1").removeClass("WrongBttn RightBttn ui-icon-delete ui-icon-check");

                //$("#Key"+i+"1").text("พหุ");
                //FadeIt("#Key"+i+"1");
            }
        }
    }
    else {
        for (i = 0; i < 8; i++) {

            if (!$("#Key" + i + "0").hasClass("ui-icon-carat-r")) {
                $("#Key" + i + "0").addClass("ui-icon-carat-r ui-alt-icon");
                $("#Key" + i + "0").removeClass("WrongBttn RightBttn ui-icon-delete ui-icon-check");

                $("#Key"+i+"0").text("เอก");

            }

            if (!$("#Key" + i + "1").hasClass("ui-icon-carat-r")) {
                $("#Key" + i + "1").addClass("ui-icon-carat-r ui-alt-icon");
                $("#Key" + i + "1").removeClass("WrongBttn RightBttn ui-icon-delete ui-icon-check");

                $("#Key"+i+"1").text("พหุ");

            }
        }
    }


    //console.log("D34");

    // Populate answer table


    for (i=0;i<8;i++) {

        n_vibhatti_ans[i] = new Array();

        for (j=0;j<2;j++) {

            n_vibhatti_ans[i][j] = new Array ();

            console.log("subpattern_ID="+subpattern_ID+" i="+i + " :: "+vi_rupa[subpattern_ID][i][j]);


            if (jQuery.isArray(vi_rupa[subpattern_ID][i][j])) {


                for (k=0; k<vi_rupa[subpattern_ID][i][j].length; k++) {


                    n_vibhatti_ans[i][j].push (rupa(noun, vi_rupa[subpattern_ID][i][j][k]));


                }
            }


            else
                n_vibhatti_ans[i][j].push(rupa(noun, vi_rupa[subpattern_ID][i][j]));


        }
    }

    console.log("------");

    console.log (n_vibhatti_ans[0][0]);


    //$("#Debug").html (noun+ " / " + r_vi + "" + r_va);


    if (r_vi == 0 && jQuery.isArray(n_vibhatti_ans[r_vi][r_va]) && n_vibhatti_ans[r_vi][r_va].length==0)
        r_vi = randomise(1, 7); //ไม่มีอาลปนะ

    do {
        if (jQuery.isArray(n_vibhatti_ans[r_vi][r_va]))
            key = n_vibhatti_ans[r_vi][r_va] [randomise(0, n_vibhatti_ans[r_vi] [r_va].length - 1)];
        else
            key = n_vibhatti_ans[r_vi][r_va];
        if (key == "-")
            r_va = 1-r_va;
    } while (key=="-"); // loop if เอกวจนะ only or พหุ only  and change วจนะ



    /*if (pattern_ID==-1)
     $("#Question").text (key);
     else*/

    $("#Question").text (key);
    $("#Meaning").text ("("+meaning+")");
    $("#Gender").html (gender);


    for (i=0; i<8; i++)
        for (j=0; j<2; j++) {
            if (n_vibhatti_ans[i][j].indexOf(key)!=-1) {
                n_vibhatti_ans_boo[i][j] = true;
                ans_count++;
            }
        }

    if (mode_group==2) {
        Q_timer = jQuery.now()+ (FanCountDown* 1000);
    }
    else {
        $("#SurrenderBttn").removeClass("ui-icon-forward");
        $("#SurrenderBttn").addClass("ui-icon-search");
        $("#SurrenderBttn").text("เฉลย");

        $("#SurrenderBttn").unbind("click");
        $("#SurrenderBttn").click(surrender);
    }
}


function surrender() {

    /*
     if ($("#SurrenderBttn").toggleClass("ui-icon-forward"))
     {
     n_vibhatti_init();
     return;
     }*/

    ans_count = 999;
    var i,j;
    for (i=0; i<8; i++) {
        for (j=0; j <2; j++) {
            ans (i,j);
        }
    }
    ProducePassBttn();

}

function ProducePassBttn () {
    $("#SurrenderBttn").removeClass("ui-icon-search");
    $("#SurrenderBttn").addClass("ui-icon-forward");
    $("#SurrenderBttn").text("ข้อต่อไป");

    $("#SurrenderBttn").unbind("click");
    $("#SurrenderBttn").click(n_vibhatti_init);
}

function ans (i, j) {

    if (!$("#Key" + i + "" + j).hasClass("ui-icon-carat-r"))
        return;

    $("#Key" + i + "" + j).text(n_vibhatti_ans[i][j]);
    $("#Key" + i + "" + j).removeClass("ui-icon-carat-r ui-alt-icon");


    if (n_vibhatti_ans_boo[i][j]) {     // CORRECT ANSWER


        $("#Key" + i + "" + j).addClass("RightBttn ui-icon-check");

        switch (mode_group) {

            case 1:
                total_right_count++;
                if (--ans_count==0)     ProducePassBttn();
                break;

            case 0:
                $("#right_count").text (++total_right_count);
                if (--ans_count==0)     ProducePassBttn();
                break;

            case 2:
                //$("#right_count").text (++total_right_count);
                total_right_count++;
                $("#Fan").text("ถูกต้องนะครับ!");
                $("#Fan").css("color","green");
                $("#Fan").fadeIn(0).fadeOut(1000);

                if (--ans_count==0)     n_vibhatti_init();
                else
                    Q_timer = jQuery.now()+(FanCountDown*1000);

                break;
        }


        return;
    }


    $("#Key" + i + "" + j).addClass("WrongBttn ui-icon-delete");

    switch (mode_group) {
        case 1:
            total_wrong_count++;
            break;
        case 0:
            $("#wrong_count").text (++total_wrong_count);
            break;
        case 2:
            //$("#wrong_count").text (++total_wrong_count);
            $("#Fan").text("ผิดครับ!");
            $("#Fan").css({"color":"red"});
            $("#Fan").fadeIn(0).fadeOut(1000);

            total_wrong_count++;
            n_vibhatti_init();
            break;
    }
}

function setTimer () {
    var t = jQuery.now()-start_timer;
    if (t>0) {

        /*if (mode_group==1)
         console.log ("YEAH");
         */
        $("#time_spent").text("");

        $("#SumRight").text(total_right_count);


        if (mode_group==2)
            $("#SumWrong").text((total_wrong_count+total_miss_count) + " (ผิดจริง "+total_wrong_count+" ตอบไม่ทัน "+total_miss_count+")");
        else
            $("#SumWrong").text(total_wrong_count);

        if (mode_group==2)
            $("#SumAccu").html( "โดยรวม "+ (100*total_right_count/(total_right_count+total_wrong_count+total_miss_count)).toFixed(2)+
                "%<BR />("+
                "ตอบทัน "+(100*(total_right_count+total_wrong_count)/(total_right_count+total_wrong_count+total_miss_count)).toFixed(2)+ "% "+
                "ตอบถูก "+(100*total_right_count/(total_right_count+total_wrong_count)).toFixed(2)+ "%)");
        else
            $("#SumAccu").text((100*total_right_count/(total_right_count+total_wrong_count)).toFixed(2)+"%");

        if (mode_group==0)
            $("#SumSpeed").html( (total_right_count*60000/t).toFixed(2)+" คลิกต่อนาที (นับเฉพาะที่ถูก)<BR />(เวลาที่ใช้: "+Math.floor(t/60000)+" นาที "+ Math.ceil((t%60000)/1000)+" วินาที)");
        else
            $("#SumSpeed").text( (total_right_count*60/SecondsCountDown).toFixed(2)+" คลิกต่อนาที (นับเฉพาะที่ถูก)");

        $("#SummaryWindow").popup("open");
        return false;
    } //.toFix(3)

    if (mode_group==1)
        $("#time_spent").text( (-t/1000).toFixed(3) );

    else if (mode_group==2) {

        var t2 = Q_timer-jQuery.now();
        if (t2< FanCountDown*1000 - 500)
            while (Whiten.length) {
                t = Whiten.pop();
                //console.log(t[0]);
                $("#Key"+t[0]+t[1]).removeClass("WrongBttn RightBttn");
                if (t[1]==0)
                    $("#Key"+t[0]+t[1]).text("เอก");
                else
                    $("#Key"+t[0]+t[1]).text("พหุ");
            }


        if (t2<0) {

            $("#Fan").text("ไม่ทันครับ!");
            $("#Fan").css({"color":"violet"});
            $("#Fan").fadeIn(0).fadeOut(1500);
            total_miss_count++;

            //$("#wrong_count").text (++total_wrong_count);
            n_vibhatti_init();


        }
        else {
            t=t2/(FanCountDown*500);
            $("#FanProgress").css("height",Math.floor(t*50)+"%");
            //$("#FanProgress").css("height","0%");
            //$("#FanBar").text(t);
            $("#FanBar").css("background-color","rgb("+Math.ceil(255*Math.min(1,2-t))+","+Math.ceil(255*Math.min(t,1))+",0)");
        }


        $("#time_spent").text( Math.ceil(t2/1000) );
    }


    Timer = setTimeout(setTimer, 55);
}


function SelectStage (i) {
    pattern_ID = i;
    Cookies.set('Stage',i, { expires: 365 });

    //console.log ("Stage selected = "+i);

    if (i==-1) {

        $("#SelectStageLink").text("รวมมิตร");
        return;
    }
    //if (jQuery.isNumeric(i))

    else
    $("#SelectStageLink").text(subpattern_list[i][4]);

    //window.location = "#MenuPage";

}

function SelectMode (i, isSwap) {



    mode_ID = 10*isSwap + i;
    Cookies.set('Mode',mode_ID, { expires: 365 });

    //console.log (mode_ID);

    if (isSwap == 1) {


        SelectSwapMode (i);

        return;
    }

    $("#NewGameLink").prop("href", "#VibhattiGamePage");


    $("#SelectModeLink").text(mode_list[i]);

    switch (mode_ID) {
        case 2:
            FanCountDown = 3;
            mode_group = 2;
            break;
        case 3:
            FanCountDown = 5;
            mode_group = 2;
            break;
        case 4:
            FanCountDown = 10;
            mode_group = 2;
            break;
        default:
            mode_group = mode_ID;
    }


    switch (mode_group) {
        case 1:
            $("#Mode_0").css({"color":"black", "font-size":"100%", "text-decoration":"none"});
            $("#Mode_0").show();    // Time spent
            $("#Mode_1_1").hide();
            $("#Mode_1_2").hide();


            $("#SurrenderBttn").show();
            $("#GameToMenuBttn").unbind("click");
            $("#FanBar").hide();

            break;

        case 0: $("#Mode_0").hide();
            $("#Mode_1_1").show();  // Correct
            $("#Mode_1_2").show();  // Incorrect


            $("#SurrenderBttn").show();
            $("#GameToMenuBttn").click(setTimer);
            $("#FanBar").hide();

            break;

        case 2:
            $("#Mode_0").css({"color":"red", "font-size":"200%", "text-decoration":"bold"});
            $("#Mode_0").show();
            $("#Mode_1_1").hide();
            $("#Mode_1_2").hide();

            $("#SurrenderBttn").hide();
            $("#GameToMenuBttn").unbind("click");
            $("#FanBar").show();

            break;

        default:
            console.log("this is probably a bug in SelectMode.");

    }

    //console.log ("Mode selected = "+i);
}

function NewGame () {

    total_right_count = 0;
    total_wrong_count = 0;
    total_miss_count =0;



    n_vibhatti_init ();


    //console.log("mode_group = "+mode_group);

    switch (mode_group) {
        case 1:

            start_timer = jQuery.now()+(SecondsCountDown*1000);
            setTimer();

            break;
        case 0:


            $("#right_count").text(0);
            $("#wrong_count").text(0);

            start_timer = jQuery.now();


            break;
        case 2:
            /*ProducePassBttn();
             $("#SurrenderBttn").text("ผ่าน");*/

            //$("#right_count").text(0);
            //$("#wrong_count").text(0);

            start_timer = jQuery.now()+(SecondsCountDown*1000);
            Q_timer = jQuery.now()+(FanCountDown*1000);
            setTimer();
            break;

        case 10:

            //prepareMatchingGame();
            break;

        default:

            console.log("this is probably a bug in NewGame.");
    }

    //console.log ("NEW GAME timer="+start_timer);



    //window.location = "#GamePage";



}

/*
 function OpenPage (page) {
 var PageList = ["Menu", "Game"]

 for (var i=0; i<PageList.length; i++) {
 if (PageList[i]!=page)
 $("#"+PageList[i]+"Page").hide();
 }

 $("#"+page+"Page").show();
 //alert(page)
 }
 */

/*
 var ZoomIndex = 1;

 function Zoom(i) {
 ZoomIndex+=i;
 $(document.body).css({"zoom":ZoomIndex, "-moz-transform":"scale("+ZoomIndex+")"});
 }
 */
